coronavirus 156362
twitter.com 64339
web 57929
mask 50280
pandemic 37890
wear 36433
people 30338
Trump 26342
data 26191
masks 26056
like 23415
cant 22578
dont 19171
get 18479
one 15460
want 15409
#COVID19 14764
cases 14754
day 14736
virus 14373
000 14217
new 13925
amp 13776
Im 13725
positive 13333
tested 12897
still 12598
wearing 12535
schools 12140
Americans 11553
face 11365
Florida 11146
CDC 10664
COVID19 10598
good 10592
think 10347
back 10233
years 9617
going 9534
19 9111
corona 9067
trust 9002
trying 8954
clear 8911
stay 8890
President 8861
lockdown 8710
15 8668
us 8629
need 8567
USA 8430
forward 8366
months 8315
go 8221
moving 8099
got 8058
BREAKING 7950
said 7882
time 7807
forth 7709
EXTREMELY 7694
Blocking 7689
says 7677
Governor 7636
doesnt 7525
today 7495
deaths 7480
Walmart 7350
Dont 7335
weve 7303
look 7297
10 7266
know 7116
House 7082
see 7033
luck 6921
number 6835
right 6767
New 6677
White 6676
community 6665
work 6602
life 6583
tampons 6497
students 6447
public 6419
worse 6418
would 6405
due 6314
social 6305
quarantine 6285
health 6276
news 6217
stop 6207
US 6148
first 6092
hospitals 5998
The 5974
really 5931
days 5857
patients 5827
July 5814
top 5678
even 5672
free 5671
mandatory 5671
Oklahoma 5627
country 5561
2020 5555
online 5551
much 5505
countries 5489
world 5453
make 5374
political 5362
black 5332
many 5331
Health 5277
home 5265
to 5262
may 5230
could 5217
wont 5191
youre 5154
Gov 5153
every 5148
running 5117
didnt 5090
Kevin 5084
test 5076
help 5010
student 4985
never 4979
whether 4971
control 4952
alive 4945
school 4940
thing 4935
threat 4847
reopening 4824
reopen 4789
way 4750
missed 4748
Stitt 4744
11 4716
guidance 4702
Shes 4678
classes 4659
reporting 4654
ago 4649
numbers 4624
shirt 4586
believe 4574
07 4566
in 4538
minutes 4529
measure 4522
American 4498
made 4495
wave 4464
dead 4452
regulate 4447
puzzled 4426
hems 4421
adjudicate 4420
care 4406
deemed 4370
20 4350
caseworker 4338
@2STEPNEV 4335
tomb 4326
raider 4323
#coronavirus 4322
Yes 4312
must 4291
vaccine 4285
use 4276
family 4239
trump 4178
everyone 4156
@realDonaldTrump 4138
children 4066
STOP 4059
hospital 4058
take 4057
response 4024
COVIDfree 4022
government 4017
Please 3999
since 3948
last 3928
infected 3915
getting 3913
without 3887
releases 3875
death 3865
week 3864
say 3862
spread 3860
@sarahcpr 3832
covering 3832
distancing 3820
testing 3820
kids 3796
keep 3793
case 3777
Wear 3767
customers 3761
state 3699
54 3684
sent 3673
friends 3661
exist 3603
tests 3581
literally 3564
rate 3532
report 3530
story 3513
and 3501
administration 3499
states 3499
also 3493
Royal 3463
someone 3406
handling 3389
2.001K 3363
year 3349
14 3342
weeks 3338
Ive 3337
York 3337
Dr 3325
sneeze 3301
featured 3294
require 3289
allergies 3274
forget 3265
100 3253
well 3252
2.02K 3248
best 3234
better 3226
killed 3224
give 3222
Allergies 3215
four 3202
rerouted 3200
deadly 3176
store 3176
via 3174
instead 3172
reported 3165
protect 3117
saying 3116
please 3094
News 3083
died 3069
hope 3067
of 3067
start 3038
safe 3018
understand 2986
lives 2952
racist 2946
two 2945
Pandemic 2943
Fauci 2941
seconds 2929
Control 2901
bro 2892
FORCING 2877
Masks 2872
normal 2861
13 2859
Thats 2851
Jair 2839
bad 2827
hours 2825
baby 2775
latest 2722
ass 2720
around 2715
Texas 2712
crisis 2692
recover 2691
coming 2684
30 2657
die 2656
March 2642
thank 2636
reminder 2633
open 2617
real 2612
stores 2603
135 2594
system 2578
july 2574
Breaking 2568
next 2567
bringing 2565
thats 2563
caught 2559
long 2546
live 2535
stability 2520
20s 2519
TRUMP 2518
@felipeneto 2515
watch 2505
talking 2504
@SakotaDage 2494
pray 2489
giving 2480
isnt 2478
lost 2474
away 2463
shower 2461
plan 2459
the 2458
@nytopinion 2452
find 2425
condoms 2420
put 2412
County 2406
starting 2394
2 2392
seen 2379
Donald 2378
Corona 2371
actually 2370
close 2368
results 2368
another 2365
opposed 2365
done 2361
Making 2359
sure 2356
follow 2353
workers 2340
Starting 2335
needs 2326
China 2324
Lets 2321
job 2319
wore 2317
People 2314
makes 2297
media 2288
Trumps 2284
money 2281
working 2251
required 2241
Hospital 2237
things 2233
question 2229
let 2227
damn 2216
Instead 2213
told 2209
enough 2195
GOD 2192
others 2178
person 2174
3 2164
labs 2163
come 2156
restrictions 2156
governor 2153
end 2152
send 2152
realize 2143
risk 2141
police 2135
support 2129
feel 2126
1.0K 2116
Disease 2107
customer 2103
man 2095
exposed 2086
Strips 2077
kind 2074
something 2073
read 2066
Centers 2058
already 2050
staff 2048
570 2040
times 2040
yall 2038
least 2035
lot 2029
great 2020
hell 2016
hear 2013
Data 2008
delivered 2006
business 2003
300 2000
@bigdaddyvinz 2000
570K 1999
problem 1995
anywhere 1986
t. 1985
making 1978
tell 1976
major 1975
whole 1973
theyre 1971
hour 1963
point 1963
love 1959
teachers 1957
HOSPITALS 1952
big 1952
DONALD 1943
Republican 1932
4 1924
banned 1923
change 1922
SENDING 1919
One 1907
States 1900
hard 1900
is 1900
@ProjectLincoln 1896
anyone 1894
UK 1886
12 1882
kicking 1876
positivity 1876
tweet 1874
address 1869
recovered 1862
40 1853
Department 1849
PPE 1843
information 1843
allow 1841
fight 1835
Admin 1832
Aldi 1832
Risk 1831
Grubhub 1830
135000 1829
sick 1828
spikes 1828
freedom 1826
closed 1824
Every 1822
call 1821
longer 1820
place 1812
fact 1809
continue 1802
straight 1798
worth 1795
president 1794
Earth 1791
United 1784
less 1784
failed 1782
#covid19 1776
for 1773
global 1756
@nick_kapur 1755
second 1748
dozen 1743
Face 1741
reason 1738
negative 1736
became 1733
status 1727
thinking 1724
show 1721
across 1719
1 1718
Thank 1713
blame 1711
decided 1707
wouldnt 1707
Kane 1702
taking 1702
eliminated 1696
everything 1694
Rumble 1683
@SamJonesMCR 1678
record 1677
shit 1676
Chart 1675
anything 1666
science 1664
families 1660
fighting 1659
Imagine 1657
yet 1642
Mask 1637
truth 1637
fucking 1633
Today 1623
try 1623
took 1618
18 1612
arent 1610
flu 1610
181 1605
went 1605
maybe 1592
part 1590
outside 1584
gonna 1579
nothing 1579
Schools 1578
full 1578
wait 1576
24 1575
probably 1568
offers 1564
total 1560
works 1558
Children 1553
lie 1550
finally 1548
ever 1542
Big 1525
amongst 1523
move 1516
Ill 1512
tools 1511
dangerous 1509
save 1506
middle 1504
food 1501
medical 1497
wanted 1492
Wisely 1489
requiring 1488
economy 1486
5 1485
ask 1482
tragic 1478
hes 1477
reports 1476
idk 1474
spin 1474
remember 1468
wants 1468
largest 1467
able 1464
Bill 1461
might 1461
Education 1460
mean 1459
kill 1457
talk 1454
theres 1445
Study 1444
confirmed 1443
London 1440
MASK 1440
article 1440
order 1435
Two 1429
increasing 1427
Administration 1426
sorry 1425
Good 1423
soon 1418
TO 1417
wrong 1416
thanks 1415
aint 1411
local 1409
Youre 1407
Dear 1400
entire 1396
musty 1395
asking 1393
HHS 1391
far 1385
nursing 1382
bc 1379
feels 1373
found 1373
ideologyand 1372
sanitizer 1371
shithole 1370
cannot 1367
defining 1358
South 1356
dine 1356
obstacle 1356
old 1354
women 1353
@bocxtop 1352
busy 1351
important 1351
thought 1345
Chilis 1344
Nearly 1343
Times 1342
rise 1338
else 1337
suppresses 1337
hit 1334
month 1331
16 1327
Another 1321
@dbongino 1319
Bitcoin 1318
florida 1318
CNN 1315
7 1313
doctors 1310
cover 1302
Well 1301
hands 1301
parents 1301
rather 1301
@mmpadellan 1292
infections 1290
University 1289
issues 1289
always 1288
reading 1288
DC 1287
Due 1284
killing 1283
ICU 1277
homes 1275
DATA 1272
10x 1271
critical 1270
National 1269
including 1268
Biden 1266
or 1266
@CNN 1264
Oh 1263
more 1263
NEW 1262
house 1262
Home 1258
Hospitals 1258
almost 1258
asked 1258
high 1256
safety 1254
Mr 1253
true 1253
@ewarren 1252
shows 1252
Unemployment 1248
etc 1248
@DWUhlfelderLaw 1245
little 1243
WEAR 1242
dying 1240
tough 1240
ENOUGH 1239
tax 1237
Cases 1236
walmart 1235
@AOC 1233
FL 1232
Boris 1231
politics 1230
50 1228
Healthcare 1227
Black 1226
State 1225
means 1225
daily 1223
200 1222
disease 1222
ONE 1221
used 1221
Heres 1220
worst 1220
California 1219
called 1219
herd 1219
retailer 1217
infection 1215
doubled 1214
video 1213
BOOKING 1211
using 1210
utm_source 1208
100000 1206
Lockdown 1202
guy 1202
study 1196
utm_medium 1196
sending 1193
started 1193
PM 1192
bring 1192
sense 1192
Republicans 1191
Cuomo 1190
pay 1186
Quarantine 1182
federal 1182
@RealCandaceO 1181
World 1180
Los 1178
serious 1178
fall 1175
thousands 1174
100% 1173
govt 1173
First 1165
share 1165
Blame 1161
mandate 1160
dealing 1158
immune 1158
unemployed 1156
Wednesday 1155
shut 1152
folks 1151
lets 1150
updated 1148
national 1146
Tulsa 1145
Californias 1140
fuck 1140
Congress 1138
Government 1135
GOP 1133
Get 1133
different 1133
caused 1130
single 1129
disparities 1128
policy 1126
McConnell 1124
im 1124
cause 1123
age 1121
Ellen 1119
IS 1119
havent 1117
@SpeakerPelosi 1113
summer 1113
businesses 1112
Director 1110
rules 1107
immunity 1098
minorities 1098
sitting 1096
flaw 1094
Even 1091
books 1091
Time 1088
employees 1087
Virus 1084
hand 1084
on 1084
Banksy 1083
Rose 1082
redhanded 1082
Mitch 1081
Wearing 1080
protecting 1077
Wage 1075
symptoms 1075
rally 1073
verified 1073
leaving 1072
nation 1069
surge 1069
tells 1068
respond 1067
climate 1066
Labs 1065
announced 1064
left 1064
EVER 1062
prison 1061
22 1060
500 1059
per 1059
matter 1058
NUMBERS 1055
School 1054
yesterday 1054
bit.ly 1052
law 1052
@RBReich 1048
hasnt 1047
issue 1047
common 1043
disposable 1043
random 1043
gets 1042
ones 1041
friend 1040
past 1036
Twitter 1035
Remember 1033
avoid 1033
following 1033
party 1033
Stay 1026
jobs 1025
Day 1023
possible 1023
message 1022
THE 1017
outbreak 1016
therapy 1015
Mary 1014
crime 1014
huge 1012
protected 1012
passed 1010
google 1009
situation 1008
behind 1007
nations 1004
fear 1003
Barr 1001
May 997
Scotland 994
beds 994
drove 994
early 994
Hand 993
package 993
have 992
HOSPITAL 988
post 985
9 983
@Respexy 982
son 982
vote 982
Social 981
level 980
surgeries 980
corporate 979
sooo 979
approach 978
looking 978
Rivera 977
likely 976
up 976
Medical 975
healthcare 974
NEWS 973
Positive 973
capitalism 972
Mike 971
has 971
Pat 968
POTUS 965
human 965
officials 965
yes 965
gotten 963
ow.ly 963
MF 962
theyve 960
@nyshuffler 959
SKEW 958
Theres 958
showing 958
citizens 956
update 954
managing 952
solve 951
IVF 949
forgot 949
@JoeBiden 948
Flu 947
2.021K 943
shop 943
India 942
Liberty 942
Orlando 942
current 941
later 941
@evanfoxy 938
cooking 938
given 938
travel 938
abuse 936
German 935
together 933
hoax 931
Club 929
whats 929
400 928
God 928
rule 926
comes 924
advice 921
slow 920
trial 920
putting 919
factor 917
smell 917
ordered 916
stimulus 915
county 913
95 912
available 912
run 911
experts 910
youve 910
Reopened 909
force 909
Alabama 908
seems 906
buy 905
guess 905
paid 905
taken 904
amid 902
whos 902
Democrats 901
Johnson 901
idea 899
spreading 899
came 898
conversion 898
course 898
team 896
Since 894
#COVID 893
patient 891
asks 890
Id 889
NBC 888
A 887
words 886
DONT 885
spokesman 884
Hey 882
extend 881
street 880
presidents 879
Lives 878
ppl 878
small 878
Sams 877
beginning 877
stupid 877
gone 875
dlvr.it 873
increase 871
low 870
questions 870
act 869
defund 869
selfquarantining 869
mom 867
Michael 865
Naya 865
members 865
met 865
saw 865
seeing 865
info 861
officers 861
play 860
45 858
Send 858
Monday 857
breaks 856
impact 856
alone 855
contact 852
Great 851
outdoors 851
guys 849
recovery 849
trib.al 849
Medicare 848
damage 848
population 848
though 847
@WhiteHouse 846
line 846
looks 846
Last 845
child 845
morning 845
bereaved 844
three 844
Also 843
access 842
wasnt 840
@nedryun 838
apply 835
set 835
signs 835
Would 834
living 834
rates 834
telling 833
along 832
glad 832
lower 832
shops 832
distance 831
10M 830
become 830
leave 828
authority 824
RECORDS 823
chance 823
provide 823
related 823
completely 822
Show 821
city 821
inside 821
Vaccine 820
Minister 818
utm_campaign 818
essential 816
no 816
Hes 814
fine 813
Joe 812
RICO 811
PUERTO 809
especially 809
Deaths 808
TRIPS 807
holding 806
Arizona 804
responsible 804
scientists 804
bypass 802
highest 802
Public 800
miss 799
murder 799
body 797
throat 797
listen 794
facts 793
shopping 793
takes 791
June 790
takeaway 790
10181 789
Disney 789
with 789
@xkcdComic 788
2333 787
Watch 787
m.xkcd.com 787
brought 786
debate 784
prevent 783
lies 781
biggest 779
education 779
forced 777
Thanks 776
evidence 775
Parents 774
among 773
mind 773
wake 773
effective 772
lying 772
rest 771
fire 770
HUGE 768
happen 768
at 766
research 766
agree 765
convention 765
sit 765
from 764
insanity 763
residents 763
bounties 762
@GovMikeDeWine 761
Angeles 760
To 760
tripping 760
Reopening 759
Washington 759
Anthony 758
Cant 758
Look 758
70 756
Julio 756
25 755
incoming 755
Could 753
Stop 753
@TheJayBurns 752
35 751
wish 751
#covid_19 750
wash 750
plans 749
refuse 749
Numbers 748
count 746
enforce 746
feeling 746
office 746
reopened 746
Chuck 745
Floridas 745
Roger 745
campaign 745
check 745
steps 745
defamation 744
economic 744
fake 744
Less 743
company 741
guidelines 741
leadership 740
restaurant 739
CASES 737
England 737
blood 737
combatting 737
woman 737
Tom 736
nose 735
300000 734
interesting 734
Russia 732
lead 732
history 731
shouldnt 729
6 728
twitter 728
112 727
hate 727
within 726
Canada 725
young 725
98% 724
nationwide 724
needed 724
goes 723
troops 723
opponents 722
Govt 721
@donwinslow 720
Maybe 720
curve 720
Lemme 718
allowed 717
supposed 717
Parade 716
led 716
Like 715
answer 715
companies 715
treatment 715
@SkyNews 714
Brennan 714
millionaires 714
worried 714
zero 714
BIG 712
half 711
white 711
antimask 709
future 708
spy 708
willing 708
Care 706
deal 706
night 706
werent 706
election 705
morons 705
safely 705
file 703
carved 702
key 702
Everyone 700
FUCKING 700
orders 700
worlds 700
*three 699
list 699
times* 699
totally 699
135000000000 698
effect 698
@jsolomonReports 696
Ohio 696
former 694
calling 693
inmates 693
joke 693
systems 693
wanna 691
@poregan 689
spike 689
statewide 689
ready 687
vaccines 687
americas 686
begin 686
happening 686
Especially 685
placed 685
@DrEricDing 684
@roywoodjr 683
tl 683
Sarah 682
learn 682
leading 681
31% 680
Nick 680
hire 680
@drdavidsamadi 679
Demands 679
NY 678
head 678
seriously 678
unless 678
French 676
relief 676
Anyone 675
@NYGovCuomo 674
@ximenaxmartinez 674
elderly 674
stuff 674
Pence 673
millions 673
cdc 672
than 671
Chinese 670
Hong 670
teacher 669
faces 668
purpose 668
Yeah 667
artist 667
Many 666
waiting 666
SARSCoV2 665
six 665
WH 664
double 664
either 664
held 664
ahead 663
Todays 661
group 661
Ivey 660
Kay 659
created 659
mandates 659
protests 658
result 658
Propaganda 657
hide 657
Americawe 656
Read 656
as 656
cloth 655
Almost 654
happened 653
@kylegriffin1 651
Cannon 651
proper 651
society 651
concerned 649
greeters 648
cancelled 647
mention 643
hold 642
return 642
wonder 642
easier 641
rent 641
heard 640
union 639
Need 638
based 638
17 636
affected 635
dollars 635
imagine 635
sing 635
healthy 634
Central 633
measures 633
Bolsonaro 632
service 632
toll 632
worry 631
drop 630
announces 629
pass 628
City 627
collection 627
Obama 626
decision 626
139 625
accurate 625
continues 625
Gilbert 623
Whats 622
despite 622
jul 622
amazing 621
pretty 621
LA 620
Wait 620
helping 620
taxes 620
@catturd2 619
choice 617
serve 616
@tedlieu 615
Moderna 615
Moves 614
sign 614
station 614
ways 614
bar 613
war 613
word 613
Tube 612
Let 611
spot 611
21 610
PANDEMIC 610
everywhere 610
learning 610
name 610
season 610
#wearamask 609
higher 609
AP 608
Critical 607
source 607
April 606
passing 606
conditions 605
sports 605
Information 604
Top 604
are 604
calls 604
stand 604
swung 603
term 603
Much 602
feet 602
Hide 601
That 601
refusing 601
shown 601
2.019K 600
crazy 600
hurt 600
places 599
ensure 598
fauci 598
recent 598
EU 597
Ghislaine 597
Reopen 597
Spread 597
shoppers 596
Italy 595
currently 595
directly 594
fails 594
20th 592
air 591
front 590
keeping 590
all 589
brain 589
sprays 588
Report 587
Wow 587
inquiry 587
worker 587
cut 586
doctor 586
absolutely 585
capacity 584
not 584
rights 584
Find 583
bout 583
brief 583
August 582
unemployment 582
138 581
competition 581
simple 581
personal 580
politicization 580
Defense 578
explain 578
individuals 578
bit 577
begun 576
coverings 576
mental 576
shes 576
heart 575
puts 575
justice 574
Make 573
VIRUS 573
loved 573
Keep 572
action 571
missing 570
photo 570
Still 569
Theyre 569
Though 568
prior 568
Testing 567
filmed 567
mother 566
private 565
hair 564
Teachers 563
watching 563
youtu.be 563
beans 562
coverage 562
fun 562
special 562
trials 562
Hi 561
Says 561
worked 561
Asked 559
active 559
knows 559
theguardian.com 559
thinks 559
becoming 558
funding 558
press 558
Weve 557
CA 555
break 555
heads 555
stencilling 555
pregnancy 554
32 553
Death 553
everybody 553
gotta 552
hardest 552
trusted 552
ventilators 552
windows 552
114 551
ignored 551
Check 550
knew 550
protection 550
reality 550
turn 550
Something 549
governments 549
asymptomatic 548
lol 548
Maxwell 547
leader 547
piece 547
afraid 546
stories 546
@NBCNews 545
game 544
database 542
Navarro 541
idiot 541
power 541
8 540
late 540
@govkristinoem 539
agencies 539
gave 539
happy 539
thread 539
helps 538
roughly 538
suit 538
395 537
Gove 535
KIDS 535
hundreds 535
leaders 534
shot 534
theyll 534
@FINALLEVEL 533
changed 532
losing 532
HAPPY 531
fully 531
step 531
@RealMattCouch 530
admits 530
MFs 529
tomorrow 529
MR 528
Daily 527
cost 527
@Walmart 526
Ugly 526
employee 526
gt 526
sight 526
MASKS 525
indoor 525
meeting 523
typing 523
utilize 523
actual 522
#pandemic 521
2nd 521
known 521
voting 521
judge 520
sad 520
Sent 519
cancer 519
chair 519
communities 519
gov 519
29 518
Join 518
4th 517
CARRIE 517
Update 517
toots 517
@KILLBILLEVOL1 516
Alotta 516
attack 516
underwear 516
@Yamiche 515
Germany 515
Peter 515
1.918K 514
according 514
Recovery 513
opening 513
whereas 513
ARE 512
DAY 512
Hydroxychloroquine 512
area 512
visiting 512
RECOVERED 511
attacked 511
heroes 511
large 511
sooner 511
626 510
definitely 510
15th 509
bars 509
car 509
screens 509
TODAY 508
example 508
figures 508
#covid 507
1626395 507
Tapper 507
independent 507
massive 507
posted 507
From 506
Man 506
easy 506
meant 506
@davidschneider 505
spent 505
donate 504
near 504
remain 504
28 503
@nytimes 503
Tests 503
breaking 503
@CDCgov 502
contracts 502
rape 502
120 501
onesizefitsall 501
Oklahomas 500
#BREAKING 499
Require 498
industry 498
problematic 498
Lethal 497
Mayor 497
beat 497
girl 496
million 495
transfers 495
@AnthonySabatini 494
ally 492
precautions 492
period 491
tourists 491
@fred_guttenberg 490
experience 490
failure 490
release 490
VOTING 489
Center 488
market 488
updates 488
border 486
facility 486
picture 486
pushing 486
33 485
See 485
grocery 485
seem 485
Serious 484
respiratory 484
@atensnut 483
Total 483
quickly 483
recently 483
Redfield 482
becomes 482
couldnt 482
cure 482
resident 482
canceled 481
cycles 481
visit 481
Gates 480
Office 480
Chick 479
conference 479
demand 479
event 479
loses 479
manipulate 478
miscarriage 478
opinion 478
surging 478
@HKrassenstein 477
DAMN 477
GET 477
Take 477
Turns 477
proud 477
Springs 476
cnn.com 476
lack 476
side 476
23 475
31 475
personally 475
@JazzyJon 474
ectopic 474
fans 474
videos 474
@gatewaypundit 473
Andrew 473
concerns 473
vulnerable 473
1000 471
Wuhan 471
138000 470
Use 470
false 470
ridiculous 470
Go 469
Johnsons 469
Must 469
anymore 469
pleasure 469
@JaniceDean 468
stage 468
BBC 467
football 467
kid 467
nice 467
retweet 467
Atlanta 466
British 466
midst 466
reduce 466
600 465
bed 465
often 465
DeSantis 464
Say 464
Tuesday 464
hospitalizations 464
Kong 463
financial 463
Back 462
Sweden 462
management 462
youll 462
basic 461
centers 461
selfish 461
supplies 461
will 461
nearly 460
paying 460
allows 459
learned 459
soldiers 458
DeVos 457
Media 457
mistake 456
Muslim 455
WATCH 455
All 454
Canyon 454
Mortality 454
handle 454
repeatedly 454
happens 453
Elementary 452
Freedom 452
Wild 452
blaming 452
ok 452
mortality 451
Americas 450
Karen 450
attempt 449
general 449
men 449
closing 448
link 448
revealed 448
@johncardillo 447
emergency 447
class 446
60 445
ANOTHER 445
GO 445
poor 445
adults 444
clearly 444
security 444
Yall 443
eat 443
1st 442
hopefully 442
ending 440
frontline 440
india 440
levels 440
@nmeyersohn 439
chain 439
efforts 439
resources 439
ur 439
Reporting 438
forces 438
several 438
grateful 437
lose 437
meet 437
type 437
@kurteichenwald 436
conspiracy 436
excuse 436
physician 436
spending 436
137 435
bail 435
brings 435
restaurants 435
short 435
flipping 434
lawn 434
narrative 434
win 433
@MSNBC 432
@glennkirschner2 432
CMP 432
So 432
contract 432
expect 432
refused 432
Distancing 431
exactly 431
transmission 431
@spectatorindex 430
According 430
Caught 430
Hanks 430
Oxford 430
hospitalized 430
microphone 430
strong 430
empty 429
remote 429
terrorized 429
@GovernorTomWolf 428
Vote 428
broke 428
Africa 427
PMQs 427
Right 427
jail 427
products 427
remains 427
hiding 426
rising 425
tempted 425
HAVE 424
Tested 424
catch 424
vs 424
enter 423
Work 422
focus 422
offer 422
playing 422
planning 421
FYI 420
Learn 420
quite 420
BEDS 419
Gavin 419
claimed 419
groups 419
oklahoma 419
perfect 419
@steeleio_ 418
abt 418
changing 418
dropped 418
that 418
truly 418
Their 417
complaining 417
daughters 417
protesting 417
services 417
THIRD 416
reached 416
scandal 416
smart 416
hotel 415
nytimes.com 415
stopped 415
CEO 414
Tax 414
insurance 414
36 413
attacking 413
helped 413
46 412
blue 412
complete 412
dumb 412
expected 412
facing 412
Hope 411
clients 411
effects 411
gag 411
song 411
Senate 410
regarding 410
california 409
gross 409
discuss 408
doubt 408
participated 408
@GovRonDeSantis 407
Sorry 407
hysteria 407
inequalities 407
#trumpvirus 406
Jake 406
TIME 406
Secretary 405
arrest 405
consider 405
corrupt 405
@valventress_ 404
Act 404
Eventually 404
hot 404
scenario 404
mass 403
scared 403
@ChuckCallesto 402
Governors 402
date 402
suffering 402
thunderstorm 402
BJP 401
MUST 401
everyday 401
possibly 401
non 400
victims 400
virtual 400
Life 399
program 399
warning 399
LOCKDOWN 398
cities 398
idiots 398
tried 398
@BW 397
FACT 397
Yet 397
be 397
ruling 397
track 397
TV 396
Workers 396
cold 396
scientific 396
wears 396
Australia 395
Patriot 395
denied 395
files 395
accepted 394
trade 394
trap 394
Live 393
N95 393
Purposely 393
facilities 393
94% 392
Hello 392
account 392
studies 392
Orange 391
mandated 391
120000 390
accelerated 390
kills 390
listening 390
problems 390
rooms 390
Officials 389
Stones 389
fraud 389
heres 389
laughed 389
postponed 389
club 388
guilty 388
#PMQs 387
@senatemajldr 387
Michigan 387
Prime 387
join 387
regularly 387
bitch 386
finding 386
moment 386
out 386
room 386
squirrel 386
#heroesact 385
Fox 385
Help 385
@GovStitt 384
OK 384
average 384
mouth 384
paper 384
thoughts 384
trumps 384
@ericgarland 383
Chief 383
after 383
arranged 383
cares 383
9.4% 382
Israel 382
now 382
pm 382
Friday 381
@YouTube 380
coconspirator 380
display 380
international 380
lockdowns 380
role 380
@latimes 379
Cooper 379
Is 379
TRANS 379
risking 379
tens 379
Always 378
Heroes 378
Nothing 378
Veterans 378
flatten 378
supermarket 378
00 377
@ajplus 377
@chuckwoolery 377
amount 377
red 377
Raise 376
attention 376
push 376
records 376
skin 376
Campaign 375
ER 375
Newsom 375
Oxfords 375
Really 375
extra 375
nail 375
politicians 375
reach 375
HELP 374
awarded 374
quick 374
wednesday 374
bullshit 373
bungled 373
effort 373
vital 373
finds 372
initiative 372
underground 372
Never 371
destroyed 371
selling 371
#staysafe 370
Best 370
In 370
Looks 370
staying 370
terrible 370
walk 370
Ireland 369
admin 368
bill 368
five 368
gloves 368
spend 368
BLM 367
DeWine 367
HYDROXYCHLOROQUINE 367
NYC 367
hits 367
mine 367
released 367
War 366
recorded 366
Isnt 365
difficult 365
gain 365
illegal 365
points 365
through 365
26 364
complaint 364
create 364
district 364
removed 364
November 363
eight 363
god 363
twice 363
Phase 362
brother 362
incompetence 362
ohio 362
Matter 361
Questions 361
SA 361
danger 361
strategy 361
treat 361
we 361
Brazils 360
Victory 360
energy 360
Sir 359
ill 359
plasma 359
showed 359
winter 359
Robert 358
Test 358
antibodies 358
potential 358
soul 358
Guard 357
difference 357
throughout 357
Stone 356
Woolery 356
couple 356
True 355
developed 355
nurses 355
okay 355
recession 355
transparency 355
80 354
Police 354
clinics 354
expert 354
legal 354
light 354
populations 354
Kids 353
25% 352
cell 352
hydroxychloroquine 352
stats 352
2000 351
@ASlavitt 351
@thehill 351
Working 351
official 351
responsibility 351
Force 350
claims 350
phase 350
wife 350
#SARSCoV2 349
#lockdown 349
@TeaPainUSA 349
by 349
cancel 349
demanding 349
driver 349
involved 349
flights 348
girls 348
severe 348
airport 347
exceeds 347
stock 347
Overall 346
infect 346
refuses 346
till 346
Matt 345
PA 345
devised 345
funny 345
profit 345
soooo 345
training 345
ACCURATE 344
Event 344
MS13 344
POSITIVE 344
They 344
armed 344
supply 344
Love 343
bus 343
changes 343
governors 343
statistics 343
wisdom 343
# 342
attended 342
favorite 342
whatever 342
Britons 341
afford 341
areas 341
attending 341
coffin 341
suddenly 341
trafficking 341
50000 340
Brazil 340
ICUs 340
Video 340
growing 340
@paulkrugman 339
hospitalization 339
surprised 339
tonight 339
drive 338
headlines 338
@AnaCabrera 337
Kroger 337
Listen 337
Rate 337
china 337
lied 337
noting 337
particular 337
physical 337
4.7K 336
beyond 336
experiencing 336
journalists 336
music 336
oh 336
supporting 336
137000 335
Arkansas 335
STILL 335
San 335
condition 335
website 335
latimes.com 334
proven 334
simply 334
@CIA 333
@WHO 333
Fuck 333
Meanwhile 333
Stephen 333
decisions 333
players 333
dining 332
majority 332
minute 332
published 332
@SethAbramson 331
George 331
Global 331
assessed 331
increased 331
lots 331
peoples 331
final 330
@SenKamalaHarris 329
TX 329
Tell 329
West 329
daycare 329
embarrassing 329
15300 328
27 328
book 328
choose 328
option 328
reasons 328
risks 328
self 328
Buy 327
Sign 327
System 327
Truth 327
additional 327
aware 327
fast 327
Group 326
Yvette 326
began 326
epicenter 326
request 326
senior 326
speak 326
12th 325
@jaketapper 325
AZ 325
LIVE 325
None 325
North 325
hearing 325
received 325
site 325
Japan 324
forever 324
fucked 324
lab 324
monsters 324
practice 324
@DrDenaGrayson 323
celebrating 323
@AlyssaColeLit 322
OKLAHOMA 322
Starmer 322
adviser 322
heat 322
charge 321
felt 321
indeed 321
poll 321
Azerbaijan 320
Come 320
Fil 320
appears 320
sites 320
viral 320
beautiful 319
estimate 319
fit 319
mad 319
note 319
payment 319
1000s 318
He 318
Someone 318
coverup 318
interview 318
yeah 318
9000 317
WUSS 317
hustle 317
mistakes 317
Confirms 316
Houston 316
Solely 316
main 316
water 316
1100 315
Customers 315
Fighters 315
confirms 315
department 315
turned 315
Defund 314
Think 314
azerbaijan 314
ignoring 314
policies 314
@cnnbrk 313
John 313
allowing 313
multiple 313
opportunity 313
CANT 312
Free 312
armenian 312
content 312
encouraged 312
plague 312
attacks 311
letting 311
Rally 310
Will 310
chart 310
college 310
dad 310
necessary 310
#stayhome 309
Geraldo 309
NOT 309
resign 309
victory 309
warns 309
#trump 308
Ask 308
Full 308
Million 308
Ron 308
Supreme 308
daughter 308
jealous 308
nurse 308
space 308
survive 308
volunteers 308
@YvetteCooperMP 307
Russian 307
progress 307
texas 307
Chumbawambathemed 306
Science 306
blog 306
Lol 305
Virginia 305
Without 305
Despite 304
cool 304
disappear 304
except 304
race 304
respect 304
@danielsgoldman 303
Case 303
anti 303
crowd 303
protest 303
Betsy 302
articles 302
director 302
figure 302
requires 302
@GOP 301
Orders 301
PEOPLE 301
Task 301
clinical 301
events 301
ignore 301
2.885K 300
92.507K 300
High 300
Pkwy 300
honestly 300
member 300
90% 299
committed 299
donald 299
eyes 299
foreign 299
games 299
insane 299
Fall 298
PANIC 298
REPORT 298
UPDATE 298
phone 298
reopens 298
smth 298
town 298
Company 297
France 297
ICYMI 297
Judge 297
accounts 297
corruption 297
super 297
Call 296
Morgan 296
Ok 296
Post 296
breathing 296
@POTUS 295
RT 295
September 295
fired 295
unsafe 295
CITY 294
Doctors 294
contain 294
exists 294
launches 294
none 294
rawstory.com 294
shutdown 294
@mitchellvii 293
Dems 293
Illinois 293
KNOW 293
Mexico 293
Year 293
basically 293
board 293
premiere 293
stress 293
Donating 292
Hypocritical 292
Mark 292
Tory 292
deserve 292
solution 292
tracing 292
@Fox35Amy 291
Thursday 291
Watching 291
admit 291
anyway 291
breathe 291
challenges 291
informed 291
regulations 291
voters 291
January 290
Mandatory 290
Scott 290
UnitedHealth 290
challenge 290
employment 290
nonsense 290
ventilator 290
@AlexBerenson 289
After 289
Human 289
announcing 289
lasting 289
11000 288
Board 288
Delhi 288
dies 288
viruses 288
FUCK 287
Fight 287
amirite 287
contagious 287
deep 287
horrible 287
ship 287
stuck 287
voted 287
was 287
Govts 286
Guardian 286
Of 286
incompetent 286
#florida 285
Ontario 285
Rips 285
apparently 285
harmed 285
launched 285
quarantined 285
racism 285
Democrat 284
Facebook 284
Want 284
Wash 284
add 284
keeps 284
Yorkers 283
pubs 283
taught 283
140 282
@FLOTUS 282
America 282
Gentle 282
Indian 282
MSM 282
hides 282
mild 282
third 282
250 281
Relief 281
This 281
development 281
lived 281
sir 281
On 280
Patients 280
Reports 280
St 280
Unfortunately 280
claim 280
cnn.it 280
drug 280
skewed 280
Business 279
destroy 279
internationally 279
outI 279
secret 279
surely 279
125 278
Israeli 278
agenda 278
turning 278
65 277
75 277
Far 277
However 277
Keir 277
Union 277
aid 277
alarming 277
americans 277
battle 277
causes 277
generous 277
proof 277
#covid-19 276
@piersmorgan 276
Ala 276
Court 276
Hancock 276
Order 276
bet 276
enjoy 276
extremely 276
invade 276
lecture 276
writing 276
MONTGOMERY 275
bank 275
de 275
door 275
peak 275
scary 275
ya 275
@C_3C_3 274
Approved 274
NHS 274
Senator 274
billions 274
page 274
researchers 274
shatters 274
Doctor 273
Enjoy 273
bunch 273
recognized 273
Jersey 272
agression 272
alert 272
argument 272
concern 272
districts 272
elected 272
ongoing 272
opened 272
soaring 272
todays 272
wild 272
yo 272
@RexChapman 271
BTC 271
Revolution 271
Shot 271
Thread 271
controlled 271
dewine 271
karabakhis 271
prisoners 271
properly 271
remembers 271
south 271
webinar 271
worn 271
Response 270
building 270
gives 270
oxygen 270
statement 270
@ABC 269
Federal 269
actions 269
assault 269
ban 269
cash 269
process 269
struggling 269
Amid 268
Stunning 268
art 268
assessment 268
frankly 268
income 268
math 268
over 268
weekend 268
Absolutely 267
Miami 267
Years 267
accept 267
shocked 267
spoke 267
tired 267
#echobox 266
@BarackObama 266
Don’t 266
announce 266
anxiety 266
echobox 266
husband 266
locked 266
#stoparmenianagression 265
Costco 265
immediately 265
stayed 265
85 264
@BorisJohnson 264
@machineiv 264
EXCLUSIVE 264
Saturday 264
Seasons 264
Woolerys 264
benefits 264
boy 264
compared 264
conversation 264
onwards 264
production 264
BS 263
addressing 263
birthday 263
develop 263
driving 263
fixing 263
forcing 263
impacted 263
transparent 263
@EmeraldRobinson 262
Crisis 262
comments 262
equipment 262
min 262
Child 261
General 261
PLEASE 261
fever 261
kept 261
locations 261
lunches 261
notice 261
position 261
receive 261
remove 261
@TheDailyShow 260
@rach_taylorr98 260
FINALLY 260
Service 260
court 260
en 260
older 260
worldwide 260
Kentucky 259
Okinawa 259
Street 259
clean 259
deny 259
growth 259
knowing 259
minister 259
protections 259
relationship 259
sharing 259
starts 259
target 259
#maskup 258
32000 258
MAGA 258
Pret 258
survey 258
fardarose 257
suspicious 257
tips 257
Happy 256
card 256
counties 256
parties 256
punish 256
reaction 256
#wearadamnmask 255
@SteveScalise 255
Europe 255
fair 255
firm 255
issued 255
matters 255
#karabakhisazerbaijan 254
FAKE 254
acting 254
armenia 254
behalf 254
disaster 254
excited 254
illness 254
spreads 254
you 254
150 253
Dustin 253
WE 253
WEARING 253
absolute 253
breath 253
criminal 253
obvious 253
shields 253
train 253
weight 253
youth 253
Enough 252
antibody 252
correct 252
cuts 252
details 252
shutdowns 252
34 251
@AdamBienkov 251
catching 251
center 251
cleaning 251
include 251
jackasses 251
poster 251
rely 251
stitt 251
transport 251
41 250
Next 250
apart 250
candidate 250
grow 250
mess 250
practicing 250
thru 250
@BetteMidler 249
Criminal 249
District 249
LATINAS 249
Spanish 249
app 249
nobody 249
@AliNouriPhD 248
@dcfireems 248
Amazon 248
If 248
NEVER 248
Nobody 248
Worst 248
ability 248
build 248
claiming 248
costs 248
hacked 248
handled 248
sector 248
significant 248
talked 248
@Mike_Pence 247
Analysis 247
Destroy 247
Givin 247
Not 247
Posting 247
careful 247
increases 247
stated 247
terrifyin 247
territoryTovuz 247
tw 247
@DCPoliceDept 246
ET 246
Trump’s 246
certainly 246
planes 246
wanting 246
wherever 246
Engine 245
Left 245
WANT 245
cared 245
prepared 245
@IngrahamAngle 244
MiamiDade 244
certificates 244
digital 244
mandating 244
speaking 244
touch 244
130 243
FACE 243
VACCINE 243
boxed 243
buying 243
form 243
professionals 243
@justinhendrix 242
@ruralj 242
Park 242
Seriously 242
barely 242
fund 242
letter 242
rich 242
towards 242
@rmayemsinger 241
Jackson 241
camp 241
chief 241
loss 241
prepare 241
utm_term 241
your 241
@TommyG 240
@washingtonpost 240
Beach 240
isolation 240
played 240
scientist 240
spaces 240
walking 240
Association 239
Half 239
Severe 239
Three 239
struggle 239
wrote 239
Karens 238
Red 238
Unbelievable 238
assistance 238
demanded 238
review 238
usatoday.com 238
violence 238
Community 237
ERRORS 237
Economic 237
Traced 237
campus 237
failing 237
flight 237
overwhelmed 237
scare 237
tweets 237
Aye 236
Emergency 236
Underground 236
a 236
bigger 236
highly 236
reckless 236
stopping 236
And 235
CORONA 235
HCQ 235
delivery 235
email 235
fellow 235
mail 235
panic 235
produced 235
skills 235
uk 235
159 234
Cummings 234
Ronny 234
environment 234
responses 234
borders 233
certain 233
compulsory 233
discussion 233
dog 233
movie 233
obviously 233
48 232
@Reuters 232
COVER 232
FOUND 232
Ur 232
burning 232
canada 232
continuing 232
counting 232
sexually 232
Dem 231
Experts 231
FREE 231
Follow 231
SINK 231
Suggests 231
evil 231
series 231
upon 231
vacation 231
#COVID-19 230
#armenia 230
@JolyonMaugham 230
Kid 230
Story 230
Ventilators 230
anybody 230
consequences 230
sales 230
written 230
Inflating 229
central 229
debunk 229
protective 229
who 229
#COVIDIOTS 228
Days 228
I 228
Requiring 228
Trust 228
aka 228
cuz 228
ignorant 228
requirement 228
technology 228
universiti 228
urgent 228
@ThePubliusUSA 227
HOUSE 227
diseases 227
drugs 227
extended 227
interested 227
prove 227
raised 227
teams 227
trend 227
Chicago 226
Got 226
ballot 226
can 226
fix 226
pretending 226
promising 226
virtually 226
@renato_mariotti 225
FAA 225
Richard 225
added 225
exposure 225
managed 225
raise 225
survival 225
#FOX35 224
Disneyland 224
FOX35 224
SAVE 224
creating 224
followed 224
how 224
weird 224
AND 223
Common 223
EVERYONE 223
Everything 223
For 223
Wolf 223
controlling 223
cousin 223
march 223
novel 223
retail 223
similar 223
#mask 222
Brexit 222
English 222
Instagram 222
James 222
Potential 222
READ 222
Second 222
Zero 222
broken 222
crap 222
homework 222
knowledge 222
protocols 222
recap 222
wide 222
Local 221
admitted 221
banks 221
propaganda 221
providing 221
scam 221
sees 221
90 220
McMaster 220
Side 220
appreciate 220
likes 220
priority 220
project 220
Chair 219
Extent 219
Press 219
considering 219
contracted 219
epidemic 219
housing 219
laws 219
misinformation 219
oped 219
reveals 219
smid 219
sucks 219
Before 218
Different 218
Our 218
Safe 218
authoritarian 218
continued 218
exams 218
homeschooling 218
lady 218
options 218
parts 218
Risking 217
gun 217
polls 217
streets 217
treating 217
Amazing 216
fights 216
hero 216
ive 216
pushed 216
t.c 216
view 216
Spain 215
USFJ 215
commentisfree 215
destroying 215
devastating 215
easily 215
emails 215
exam 215
investigation 215
mike 215
omg 215
pictured 215
trip 215
write 215
#CDC 214
800 214
@Comparativist 214
@GavinNewsom 214
Herd 214
Question 214
REQUIRE 214
Reduced 214
Trial 214
colleagues 214
dry 214
followers 214
ivanka 214
owners 214
shutting 214
speaks 214
wonderful 214
#nomorewalmart 213
10000 213
Massive 213
Party 213
SAFELY 213
SC 213
THOUGHTS 213
expire 213
fewer 213
ift.tt 213
limited 213
mark 213
pls 213
rid 213
stupidity 213
whose 213
@Stonekettle 212
Manger 212
decline 212
inequality 212
inperson 212
turnout 212
111 211
67 211
Exactly 211
Nancy 211
Ted 211
Tesco 211
imposing 211
lock 211
outbreaks 211
pick 211
revenue 211
somehow 211
trans 211
@tracybeanz 210
Brazilian 210
Idk 210
LIFE 210
Louisiana 210
Thought 210
Wall 210
behavior 210
benefit 210
cronies 210
furious 210
impossible 210
sounds 210
surgical 210
traveling 210
#ohio 209
@Laurie_Garrett 209
Karnataka 209
Lap 209
Retweet 209
covered 209
funds 209
infectious 209
mountain 209
quit 209
regime 209
ultimately 209
0 208
Slams 208
Yesterday 208
checks 208
crowded 208
depression 208
fill 208
maskwear 208
proves 208
provided 208
sams 208
110 207
Pelosi 207
RECONNECT 207
Sports 207
budget 207
greater 207
killer 207
lmao 207
plus 207
this 207
treated 207
ultrasound 207
useless 207
@CBSNews 206
C0VlD 206
Distort 206
attend 206
clusters 206
mainstream 206
sheep 206
shield 206
As 205
Real 205
Sunday 205
ages 205
nature 205
pants 205
prevention 205
saving 205
CONTROL 204
Ford 204
cutting 204
preparing 204
voice 204
Economy 203
HQ 203
WHITE 203
episode 203
looked 203
lowest 203
reelection 203
sell 203
universe 203
@TONYxTWO 202
Al 202
October 202
Seems 202
eating 202
gal 202
kevin 202
offering 202
size 202
sound 202
Country 201
Hemmer 201
Outbreak 201
Secret 201
TESTS 201
career 201
drink 201
fears 201
field 201
medicine 201
myths 201
presidency 201
tho 201
East 200
Latest 200
driven 200
earlier 200
ideas 200
pandemics 200
scares 200
success 200
throw 200
Faucis 199
Homicides 199
Labour 199
Pair 199
Safety 199
TOP 199
Threatens 199
defunds 199
delay 199
direct 199
function 199
garbage 199
heartbeat 199
offices 199
powerful 199
table 199
3rd 198
DISEASE 198
European 198
Fund 198
NATIONWIDE 198
Research 198
Young 198
boycott 198
comply 198
draconian 198
eye 198
includes 198
it 198
owned 198
rep 198
#socialdistancing 197
id 197
leads 197
pull 197
releasing 197
unable 197
welcome 197
wondering 197
Blood 196
Colbert 196
Georgia 196
Interesting 196
Korea 196
Sex 196
Wrong 196
babies 196
brewing 196
church 196
comment 196
during 196
military 196
remind 196
road 196
speech 196
temporary 196
trending 196
Dad 195
JP 195
Justice 195
Men 195
Support 195
ground 195
model 195
pop 195
returning 195
trump2020 195
6.6 194
@KOCOZach 194
@narendramodi 194
Countries 194
Didnt 194
Finally 194
Halloween 194
Looking 194
Pennsylvania 194
STORES 194
approve 194
bought 194
culture 194
exempt 194
incarcerated 194
influenza 194
shame 194
shift 194
suggest 194
tool 194
#ivanka 193
CONFIRMED 193
February 193
Taking 193
beer 193
indoors 193
influence 193
mayor 193
mostly 193
moved 193
shared 193
visitors 193
@SaraCarterDC 192
FIRST 192
Former 192
Program 192
evening 192
hrs 192
requirements 192
surpasses 192
zinc 192
#stoparmenia 191
50% 191
Bank 191
Die 191
Getting 191
Karma 191
Laura 191
WTF 191
connection 191
cyber 191
green 191
hey 191
manage 191
politicize 191
rapid 191
regular 191
@NPR 190
Council 190
GOING 190
airborne 190
confirm 190
enemy 190
falling 190
faster 190
linked 190
officially 190
usual 190
900 189
CM 189
Folks 189
GROCERY 189
Give 189
Open 189
THREAD 189
Twice 189
awful 189
coronaviruss 189
grade 189
honest 189
importance 189
launch 189
pimping 189
underpants 189
Contact 188
OF 188
Shuts 188
deeply 188
demands 188
donating 188
incredibly 188
positives 188
reut.rs 188
rose 188
teach 188
threatens 188
@EricTopol 187
Dept 187
Hell 187
LONGER 187
Zealand 187
bag 187
cute 187
hoping 187
passage 187
range 187
wed 187
yrs 187
@GeraldoRivera 186
@SarahTaber_bww 186
AstraZeneca 186
Democratic 186
Going 186
Texans 186
but 186
combat 186
kong 186
lunch 186
ran 186
tarmac 186
winners 186
@CristinaAlesci 185
Plan 185
THIS 185
WRONG 185
harm 185
pain 185
perfectly 185
price 185
receiving 185
suicide 185
trouble 185
winning 185
younger 185
#corona 184
@BuffyWicks 184
@CDCDirector 184
@USATODAY 184
Beyond 184
Record 184
affect 184
affects 184
agreed 184
angry 184
fail 184
humanitarian 184
humans 184
magically 184
payments 184
tech 184
wednesdaymorning 184
@DEPLORABLEREEG1 183
@TeamTrump 183
African 183
Fake 183
Rush 183
TESTED 183
asthma 183
cheap 183
constantly 183
entering 183
flattening 183
ohioans 183
protesters 183
signed 183
unacceptable 183
wellbeing 183
Doesnt 182
False 182
Pretty 182
analysis 182
clapping 182
cnn 182
contracting 182
decide 182
individual 182
nightmare 182
Makes 181
delayed 181
load 181
saved 181
upset 181
value 181
10th 180
4% 180
83 180
@OSCE 180
DEAL 180
Goya 180
LAs 180
MPs 180
Plasma 180
Sadly 180
Target 180
Whos 180
Zinc 180
beach 180
bypassing 180
chances 180
designed 180
era 180
fox 180
host 180
liberal 180
podcast 180
silence 180
slap 180
smells 180
Shut 179
answers 179
base 179
biden 179
boris 179
considered 179
focused 179
longterm 179
publicly 179
rapist 179
so 179
sometimes 179
spiking 179
@DeAnna4Congress 178
@brithume 178
@travisakers 178
Carolina 178
Impact 178
Jazeera 178
Losers 178
Market 178
Megan 178
SAN 178
agency 178
argue 178
bonus 178
color 178
gas 178
masking 178
park 178
republicans 178
talks 178
warned 178
@Craig_A_Spencer 177
Cruz 177
Discover 177
Mistakes 177
Welcome 177
alcohol 177
covers 177
fashion 177
pretend 177
132 176
Calvin 176
Cuomos 176
Metro 176
PMs 176
Prevention 176
Winners 176
albums 176
grounded 176
recommendations 176
sets 176
suggests 176
tf 176
99% 175
@devisridhar 175
@guardian 175
Airlines 175
College 175
Dewine 175
Entertainment 175
Missouri 175
Sara 175
WalMart 175
activities 175
causing 175
closely 175
coronavirus19 175
down 175
ft 175
impacts 175
inflating 175
laughing 175
loves 175
necessity 175
settings 175
sleep 175
stylists 175
wealth 175
@AyannaPressley 174
Autofeed 174
Clintons 174
Damn 174
Hopefully 174
Kobe 174
Online 174
curb 174
explains 174
lines 174
present 174
promote 174
retailers 174
unnecessary 174
waste 174
@RepValDemings 173
Canadians 173
FLORIDA 173
Fear 173
Forum 173
cough 173
diagnosed 173
drinking 173
june 173
lapdog 173
417 172
@jonlis1 172
Bad 172
COVIDIOTS 172
Journal 172
Klein 172
MampS 172
REAL 172
arrived 172
detail 172
gym 172
heartbreaking 172
oldfashioned 172
sex 172
tainted 172
tally 172
direction 171
gatherings 171
path 171
potentially 171
watched 171
youd 171
80% 170
Ed 170
HIV 170
Lancet 170
Mar 170
Patriots 170
Services 170
Things 170
boosted 170
classroom 170
criminals 170
democratic 170
democrats 170
documented 170
dude 170
embarrassed 170
fatality 170
moron 170
rn 170
121 169
C 169
CONSERVATIVE 169
Leader 169
PHARMA 169
Pfundhelle 169
bodies 169
degree 169
runoff 169
solutions 169
successful 169
task 169
@Thomas1774Paine 168
@adrian_sleeman 168
Executive 168
Riverside 168
SCIENTISTS 168
Women 168
centre 168
exaggerated 168
goal 168
map 168
previous 168
socially 168
@NATO 167
Bracelet 167
Chris 167
Induced 167
Plus 167
Rushmore 167
Staff 167
Swedes 167
USDA 167
ends 167
hag 167
harder 167
improve 167
recoveries 167
suffer 167
supporters 167
Adverse 166
Itll 166
LESS 166
Rep 166
Unless 166
approval 166
camps 166
catastrophe 166
excellent 166
healing 166
joined 166
lesson 166
marketing 166
sister 166
trustworthy 166
yesterdays 166
810 165
@CNBC 165
@OSCEPA 165
@elonmusk 165
Per 165
Quinnipiac 165
Rosslyn 165
beating 165
buff.ly 165
debt 165
disgrace 165
fresh 165
just 165
movement 165
raging 165
tequila 165
#quarantine 164
140000 164
@BaddCompani 164
@realTuckFrumper 164
AI 164
Collection 164
Institutes 164
Ohioans 164
Students 164
channel 164
completed 164
decades 164
discourse 164
fault 164
hurricane 164
otherwise 164
passes 164
product 164
rt 164
seasons 164
turns 164
tweeting 164
vaccination 164
yr 164
20% 163
@DrZweliMkhize 163
@Weinbergrrrrr 163
@thebradfordfile 163
Better 163
Garfield 163
Minus 163
Osmania 163
Pls 163
Retailers 163
WW3 163
accepting 163
box 163
context 163
corner 163
counts 163
however 163
if 163
protects 163
wouldve 163
136 162
@Cleavon_MD 162
@KeishaBottoms 162
@NicolaSturgeon 162
@SenSchumer 162
Apparently 162
Charity 162
Dan 162
FACTS 162
Jesus 162
donated 162
explosion 162
flag 162
lung 162
racial 162
stream 162
#masks 161
@ClayTravis 161
Misinformation 161
NO 161
Rs 161
Sounds 161
dear 161
design 161
dope 161
dropping 161
fatalities 161
feeding 161
hi 161
maskwearing 161
pic 161
shares 161
traitor 161
@GMinusG 160
@simondolan 160
ABC 160
Canadian 160
CashApp 160
Theyve 160
Tonight 160
deliver 160
duty 160
encourage 160
enforcing 160
he 160
ignorance 160
negligence 160
pretended 160
returned 160
shoes 160
therefore 160
threatened 160
waiver 160
38 159
5000 159
FAUCI 159
Indias 159
Lake 159
Officer 159
assume 159
civil 159
convinced 159
feed 159
glasses 159
promise 159
quarter 159
roll 159
samples 159
teaching 159
CLOSE 158
Nation 158
VP 158
droplets 158
poverty 158
spiked 158
99 157
Iceland 157
Jeff 157
Louis 157
Oil 157
Paul 157
TPain 157
being 157
believes 157
dr 157
father 157
permanent 157
standing 157
united 157
42 156
@_machofelix 156
@thedailybeast 156
COULD 156
Click 156
End 156
Kansas 156
Lots 156
Scientists 156
Tokyo 156
arrested 156
bubonic 156
deleted 156
discovered 156
encouraging 156
maxwell 156
michigan 156
mins 156
rapidly 156
round 156
session 156
sincerely 156
victim 156
1% 155
2021 155
ADMINISTRATION 155
Gigis 155
Governments 155
Letting 155
Team 155
Your 155
confidence 155
infrastructure 155
parent 155
particularly 155
regardless 155
shortage 155
somewhere 155
thehill.com 155
workplace 155
@VP 154
Caputo 154
Carter 154
Headlines 154
ICE 154
Killing 154
LET 154
Summer 154
Why 154
august 154
boost 154
concerning 154
couldve 154
doors 154
exposing 154
guests 154
limit 154
recordbreaking 154
sacrifice 154
significantly 154
specific 154
university 154
#workfromhome 153
335 153
Actually 153
Can’t 153
Exception 153
Excited 153
Opinion 153
Shame 153
belief 153
bills 153
earth 153
funeral 153
hopes 153
initial 153
interest 153
median 153
parking 153
programs 153
recommend 153
JD 152
Manila 152
Positivity 152
QUARANTINE 152
Register 152
Type 152
Utah 152
estimated 152
germs 152
impose 152
natural 152
provides 152
quip 152
@AP 151
@PippaCrerar 151
Active 151
Freezes 151
Koreas 151
Memorial 151
Misjudged 151
Pay 151
Six 151
Zoom 151
agent 151
compliance 151
improperly 151
murdered 151
newly 151
salaries 151
@RawStory 150
@_Sflo_ 150
COVID 150
Lidl 150
Scam 150
Wake 150
orange 150
outdoor 150
pathetic 150
plandemic 150
repackage 150
smoking 150
terms 150
washing 150
widespread 150
42% 149
@charts_k 149
Asda 149
BEYOND 149
Fact 149
Guys 149
Nov 149
Other 149
PUBLIC 149
Paris 149
Save 149
Sure 149
WANTS 149
arizona 149
balloon 149
begging 149
confused 149
film 149
freaking 149
kinda 149
laugh 149
pre 149
setting 149
symptom 149
wearer 149
Bowl 148
Chill 148
Co 148
LOL 148
Limbaugh 148
Nature 148
PRACTICAL 148
SECOND 148
Warns 148
about 148
appointment 148
hill.cm 148
kits 148
reflect 148
theory 148
towns 148
01 147
06 147
30% 147
33% 147
44 147
Be 147
Coop 147
Essential 147
Reported 147
Rwanda 147
associated 147
carry 147
denial 147
dinner 147
ghislaine 147
infecting 147
isolate 147
johnson 147
journalism 147
reduced 147
senator 147
sort 147
strips 147
urge 147
vet 147
2.016K 146
@Hanna_Jameson 146
Centre 146
Insider 146
Updates 146
code 146
disabled 146
disgusting 146
guarantee 146
guide 146
lining 146
maintain 146
nbcnews.com 146
pneumonia 146
registered 146
snd 146
stunt 146
sudden 146
touching 146
#walmart 145
47 145
@Kokomothegreat 145
Doug 145
Honestly 145
King 145
Millions 145
Morning 145
Patel 145
Single 145
Stifle 145
WORLD 145
dark 145
facemask 145
facemasks 145
gofundme.com 145
homeless 145
percentage 145
surgery 145
11yearold 144
171 144
@AngelaRayner 144
Academy 144
Colorado 144
Family 144
Hydroxychloroquines 144
actively 144
boss 144
childrens 144
complain 144
credit 144
doc 144
faith 144
lap 144
lawsuit 144
p 144
packed 144
remotely 144
rioters 144
scale 144
trucks 144
ugly 144
#news 143
93 143
@GregAbbott_TX 143
BEGGING 143
Blue 143
Everybody 143
Guess 143
Hours 143
How 143
Inside 143
Kelly 143
REALLY 143
Shows 143
YOU 143
Yep 143
grandpa 143
grown 143
helpful 143
itll 143
planet 143
threatening 143
understanding 143
BC 142
Cold 142
Food 142
Important 142
Sainsbury 142
Sets 142
awareness 142
battling 142
indicted 142
perform 142
pounds 142
quality 142
responding 142
swabbed 142
uptick 142
weak 142
weather 142
#NEW 141
@business 141
Discovery 141
Garden 141
HUMAN 141
Mf 141
Ministers 141
Name 141
Way 141
cars 141
defeat 141
features 141
friendly 141
hygiene 141
its 141
platform 141
primary 141
rallies 141
shuts 141
terrified 141
terrifying 141
theories 141
#health 140
Church 140
Major 140
Nigeria 140
Tony 140
basis 140
discussing 140
effectively 140
em 140
finished 140
hoped 140
lucky 140
markets 140
midMarch 140
posts 140
sadly 140
safer 140
speed 140
stops 140
sun 140
tears 140
Based 139
DNA 139
GOT 139
Incorrectly 139
NEED 139
Shoppers 139
Shri 139
WORLDWIDE 139
blowing 139
countrys 139
cures 139
greatest 139
honk 139
ji 139
jump 139
manager 139
my 139
pressure 139
promised 139
riots 139
standards 139
wins 139
1200 138
@ItsZaeOk 138
@SusanStJames3 138
Blackburn 138
CCP 138
Capitol 138
Fucking 138
Putin 138
Washable 138
amidst 138
brazil 138
delaying 138
ended 138
entry 138
fees 138
heaving 138
immigration 138
jokes 138
powers 138
produce 138
raises 138
suspect 138
treatments 138
62 137
@ChappellTracker 137
@PTI_News 137
Among 137
HOME 137
JULY 137
Protect 137
STAY 137
YouTube 137
administrations 137
aged 137
am 137
evicted 137
filters 137
flying 137
hack 137
humanity 137
identify 137
manipulates 137
miles 137
optional 137
outrageous 137
register 137
usually 137
#trump2020 136
053 136
59 136
@PMOIndia 136
@atrupar 136
David 136
Nicola 136
There’s 136
VIDEO 136
briefing 136
bubble 136
democracy 136
hosted 136
isolated 136
other 136
previously 136
ride 136
solitary 136
spring 136
#ghislainemaxwell 135
#remotework 135
102 135
Excellent 135
II 135
INTO 135
Politics 135
TEA 135
WFH 135
WORK 135
africa 135
asshole 135
buildings 135
