coronavirus 659790
twitter.com 330912
web 300654
mask 295237
pandem 201837
wear 198557
peopl 151366
trump 125360
new 100754
day 100352
test 100339
get 98025
go 91709
case 91631
virus 90576
dont 85155
like 84954
school 82943
death 80792
one 80472
us 79457
#covid19 79118
lockdown 72577
say 69768
amp 69562
work 66807
face 63765
need 61458
quarantin 60830
time 59536
im 58166
year 57761
vaccin 55651
000 55285
health 55208
cant 53625
make 53538
state 53415
posit 53325
reopen 52945
want 51875
19 51546
covid19 51161
corona 51151
home 51105
social 50678
today 49757
die 49601
countri 49006
american 46609
still 45561
report 45543
news 45474
hospit 44709
back 44623
know 44483
week 44392
think 44085
month 43092
distanc 42844
usa 42607
see 42274
would 42200
take 41827
florida 41575
pleas 41353
the 40958
help 39939
data 39791
start 39483
first 38733
use 38549
stop 37451
good 36979
live 36524
right 36261
presid 35681
look 35278
even 35236
said 34596
patient 34574
world 33816
number 33501
to 33092
mani 32355
public 32272
stay 31864
thing 31551
famili 31527
ask 30752
due 30341
let 30233
govern 30119
break 29936
in 29851
got 29574
keep 29515
tri 28938
come 28838
realli 28363
everi 28289
care 28059
could 27993
lost 27982
hous 27805
that 27025
safe 26900
spread 26717
@realdonaldtrump 26655
your 26623
call 26619
respons 25955
everyon 25900
student 25753
2020 25625
protect 25576
doesnt 25557
two 25332
fauci 25142
way 25142
much 25116
also 24936
show 24784
sinc 24194
10 24093
follow 23923
infect 23898
china 23845
last 23840
kid 23802
open 23489
children 23137
thank 23121
fight 22776
tell 22626
well 22496
life 22271
give 22245
may 22159
made 22145
import 21960
doctor 21704
nation 21698
watch 21482
never 21452
cdc 21437
busi 21413
plan 21363
job 21294
wont 21075
dead 21013
without 20948
dr 20917
and 20916
2.02k 20895
lie 20799
kill 20336
governor 20028
white 19946
offici 19935
didnt 19931
love 19741
person 19735
fuck 19647
juli 19581
global 19526
weve 19411
must 19377
control 19281
polit 19246
#coronavirus 19177
black 18919
15 18888
hand 18872
believ 18868
forc 18797
econom 18641
of 18605
hydroxychloroquin 18445
put 18413
send 18410
support 18279
friend 18269
hour 18151
via 17989
india 17918
find 17869
anoth 17823
man 17820
close 17683
worker 17662
vote 17536
requir 17467
24 17400
risk 17317
fund 17281
elect 16923
rate 16922
updat 16920
feel 16875
total 16836
next 16807
south 16770
someon 16708
second 16564
economi 16447
uk 16421
read 16246
move 16235
hope 16220
big 16126
great 16107
place 16091
cover 16023
bill 16021
07 15904
understand 15899
alreadi 15819
caus 15810
media 15807
money 15802
done 15789
talk 15774
ago 15724
shop 15604
end 15595
surviv 15525
clear 15496
republican 15494
free 15432
million 15397
communiti 15396
actual 15380
post 15285
top 15263
save 15242
order 15198
increas 15077
happen 15059
for 15026
yall 15023
walmart 15014
york 14970
cancel 14900
citi 14883
releas 14846
studi 14837
result 14690
major 14659
refus 14647
old 14628
miss 14552
fact 14513
anyon 14471
trust 14459
ive 14422
reason 14408
20 14332
yes 14318
offic 14300
crisi 14288
mean 14281
god 14275
better 14173
pay 14138
thought 14118
effect 14104
democrat 14093
chang 14080
yesterday 14064
theyr 14026
around 13921
liter 13920
stori 13871
record 13851
yet 13789
pass 13768
parti 13739
confirm 13661
long 13659
run 13644
there 13627
best 13619
serious 13580
sure 13548
continu 13501
real 13440
unit 13405
listen 13314
wors 13305
main 13277
issu 13265
flu 13257
counti 13220
teacher 13156
hard 13146
is 13120
lead 13087
mandatori 13080
seem 13078
parent 13030
100 13008
travel 12989
away 12975
immun 12905
lot 12889
isnt 12871
wait 12856
point 12843
includ 12788
protest 12714
high 12617
rememb 12525
recov 12508
nurs 12476
wave 12473
13 12462
play 12436
depend 12427
hes 12419
someth 12404
14 12391
part 12387
govt 12371
treat 12358
medic 12340
bad 12339
texa 12325
absolut 12315
2 12307
ill 12238
guy 12166
enough 12164
store 12128
gov 12084
other 12066
mid 12064
class 12009
video 11996
learn 11940
donald 11934
unemploy 11925
prevent 11920
administr 11889
30 11855
ever 11852
biden 11816
relief 11797
hit 11707
korea 11702
forward 11697
happi 11626
1 11511
port 11469
system 11325
custom 11291
onlin 11272
allow 11261
instead 11184
sea 11157
block 11105
handl 11068
4 11044
daili 11030
exist 11021
check 11020
#covid_19 10965
meet 10887
announc 10874
kind 10852
middl 10849
famin 10836
11 10818
educ 10814
staff 10717
question 10666
pm 10650
realiz 10631
per 10617
noth 10605
employe 10573
rule 10559
bring 10539
problem 10510
polic 10502
servic 10498
told 10495
blame 10458
march 10381
morn 10346
near 10284
ppe 10223
less 10197
share 10173
sick 10169
minut 10164
discuss 10159
treatment 10150
articl 10097
possibl 9995
sever 9988
measur 9978
extrem 9950
took 9944
alway 9922
12 9903
set 9865
current 9815
whole 9810
return 9800
tweet 9773
concern 9741
experi 9701
went 9698
scienc 9658
fail 9656
almost 9638
team 9635
forget 9627
mandat 9573
remind 9543
outbreak 9529
expert 9523
threat 9517
claim 9511
complet 9496
deal 9473
status 9458
august 9432
sign 9432
human 9383
differ 9381
full 9308
on 9299
food 9288
gop 9275
ignor 9250
becom 9225
arent 9210
latest 9171
diseas 9128
3 9124
seen 9074
els 9052
compani 9034
local 9013
push 8992
fall 8947
develop 8930
what 8901
here 8877
hear 8875
shut 8874
key 8814
everyth 8812
focus 8803
reduc 8801
warn 8801
least 8796
minist 8775
impact 8754
level 8714
golf 8706
provid 8691
matter 8684
mayb 8666
normal 8652
soon 8646
nose 8641
mom 8625
act 8615
damn 8587
twitter 8586
california 8495
#covid 8480
rise 8470
surg 8442
hold 8433
spain 8420
research 8413
shes 8370
wonder 8364
fear 8356
whether 8340
inform 8334
gonna 8329
retweet 8317
restrict 8281
turn 8261
obama 8252
suggest 8242
from 8228
final 8196
situat 8179
sent 8162
scientist 8151
joe 8142
son 8118
clinic 8084
probabl 8084
imagin 8072
abl 8070
singl 8055
polici 8044
spike 8002
danger 7985
shit 7953
univers 7904
togeth 7889
girl 7886
utm_sourc 7870
creat 7863
forth 7838
luck 7833
entir 7826
far 7807
utm_medium 7783
hell 7748
three 7735
season 7720
goe 7717
manag 7694
woman 7681
leav 7670
tuesday 7662
head 7649
street 7635
despit 7630
young 7626
begin 7621
senat 7607
ny 7586
gate 7573
earli 7570
amid 7561
21 7550
200 7522
demand 7499
wash 7496
leader 7457
hey 7442
game 7438
anyth 7388
across 7384
recoveri 7380
might 7368
activ 7351
coincid 7331
sit 7325
convent 7320
oklahoma 7314
lab 7297
agre 7290
visit 7282
intent 7271
contact 7266
wrong 7255
group 7251
ass 7249
littl 7247
essenti 7231
lose 7212
insid 7209
congress 7208
practic 7204
oh 7192
tomorrow 7180
will 7167
interest 7161
symptom 7140
left 7126
attend 7113
truth 7105
9 7102
expos 7102
fine 7101
struggl 7080
feder 7074
recent 7050
member 7048
cure 7041
found 7039
25 7037
affect 7015
drop 7013
23 7001
26 7000
club 6995
300 6984
four 6981
sanit 6959
dear 6947
cuomo 6898
era 6841
join 6837
yale 6823
a 6822
east 6821
chines 6820
stupid 6815
july 6813
negat 6811
thousand 6796
johnson 6773
5 6751
episod 6746
allergi 6741
avoid 6734
past 6713
book 6707
eat 6706
healthcar 6702
event 6690
decid 6673
emerg 6665
walk 6631
serv 6625
worst 6615
guidanc 6600
racist 6598
id 6596
repli 6596
fake 6595
more 6588
action 6587
attack 6569
critic 6563
usp 6544
law 6523
restaur 6512
tampon 6508
ban 6485
count 6464
everywher 6456
babi 6447
outsid 6445
women 6441
church 6433
safeti 6431
cut 6417
receiv 6385
donat 6379
offer 6365
podcast 6361
buy 6359
child 6356
bed 6313
admit 6312
relat 6303
popul 6302
true 6301
crowd 6287
austin 6280
came 6269
highest 6269
sabotag 6264
defeat 6227
low 6220
center 6184
huge 6182
word 6179
bit.li 6177
power 6176
paper 6164
avail 6158
age 6154
aliv 6140
half 6139
idea 6128
deem 6127
sourc 6119
up 6115
@priteshgandhimd 6110
hoax 6110
list 6103
contain 6080
common 6079
rais 6062
kevin 6051
cannot 6046
frontlin 6043
sens 6035
poll 6014
13b 6009
georgia 5989
night 5978
account 5975
small 5972
beat 5968
challeng 5964
friday 5943
worri 5940
drug 5935
expect 5934
regul 5934
stand 5931
direct 5916
player 5902
st 5876
embarrass 5871
shirt 5870
privat 5866
name 5865
contract 5863
speak 5853
enforc 5850
600 5848
wake 5836
benefit 5833
line 5823
fulli 5815
president 5785
wouldnt 5772
mind 5762
coupl 5755
alon 5749
spend 5744
area 5740
pretti 5730
canada 5722
market 5701
gone 5695
cnn 5687
shown 5679
tax 5662
we 5656
war 5652
cours 5650
dalla 5645
opinion 5640
given 5635
blood 5616
evid 5614
healthi 5611
reach 5605
remov 5601
sir 5600
success 5589
north 5584
exam 5576
task 5568
bar 5566
strong 5565
@cnn 5563
disast 5561
charg 5548
50 5546
futur 5524
slow 5504
havent 5485
delhi 5468
especi 5457
suffer 5451
taylor 5440
500 5426
with 5414
fl 5409
bc 5405
though 5399
water 5390
joke 5388
ppl 5368
no 5352
mr 5344
are 5336
build 5331
suppos 5324
destroy 5278
win 5278
failur 5266
pray 5266
wish 5264
featur 5262
corrupt 5258
thread 5255
140 5241
barron 5239
plasma 5219
they 5215
ok 5213
f*****g 5209
michell 5200
sister 5191
decis 5190
product 5182
etc 5176
caught 5173
taken 5166
resid 5153
stitt 5137
trial 5137
6 5128
retail 5126
delay 5125
fire 5116
@theresa_chappl 5098
cost 5096
@joebiden 5095
saw 5085
selfcar 5081
summer 5081
approv 5071
step 5064
sorri 5060
prison 5059
mental 5039
guess 5031
hate 5027
longer 5025
depart 5024
crazi 5021
mcconnel 5017
sad 5013
freedom 5005
remain 5001
kick 4997
epidemiologist 4992
utm_campaign 4991
behind 4990
explain 4988
ad 4984
idiot 4974
optout 4971
mayor 4970
herd 4962
secur 4962
photo 4959
not 4955
how 4952
earlier 4947
folk 4939
@spotifi 4938
base 4928
#stop 4926
@michele_norri 4923
#michelleobamapodcast 4918
@micheleobama 4918
catch 4918
quick 4916
womanhood 4916
wasnt 4901
oppos 4883
riot 4854
loss 4852
air 4849
dlvr.it 4846
1.0k 4844
@projectlincoln 4844
isol 4842
among 4841
england 4840
feet 4827
spent 4813
heart 4806
08 4801
interview 4794
swift 4794
accord 4792
condit 4778
car 4775
at 4773
bodi 4769
don 4756
puzzl 4750
packag 4747
18 4727
@dwuhlfelderlaw 4723
price 4719
54 4716
glad 4716
sleep 4710
rest 4708
septemb 4707
tonight 4704
trace 4697
kept 4689
trillion 4682
breath 4679
consid 4679
worth 4672
biggest 4669
lol 4651
deserv 4648
histori 4639
fraud 4616
2nd 4614
district 4608
shot 4607
as 4601
program 4599
hundr 4597
readi 4595
curv 4594
union 4594
address 4586
be 4576
deliv 4575
space 4573
suppli 4560
weekend 4558
access 4556
fals 4552
flight 4541
toll 4528
film 4524
poor 4518
june 4517
citizen 4515
messag 4506
bori 4500
proper 4497
paid 4491
140000 4489
facil 4489
salari 4486
ventil 4478
knew 4476
amaz 4471
elimin 4471
brief 4470
either 4458
link 4441
hem 4435
unless 4434
adjud 4430
fast 4421
desanti 4417
22 4414
chanc 4410
stephen 4408
ensur 4401
16 4399
hcq 4397
raider 4393
40 4389
virtual 4388
director 4387
respond 4384
yeah 4378
enjoy 4375
mother 4374
youv 4368
larg 4364
toilet 4352
answer 4349
press 4346
casework 4343
easi 4343
my 4343
africa 4341
@2stepnev 4335
doubl 4335
tomb 4334
guidelin 4331
rather 4320
side 4307
predict 4306
train 4303
surpass 4302
opportun 4296
icu 4295
zero 4292
room 4282
late 4278
sunday 4272
exact 4271
bjp 4258
amount 4256
launch 4256
project 4256
mass 4253
extend 4226
arizona 4224
beach 4222
sport 4216
mark 4215
massiv 4212
battl 4209
vs 4191
basebal 4183
werent 4172
holiday 4170
dem 4166
court 4165
campaign 4161
leadership 4158
prepar 4150
scotland 4148
brazil 4146
or 4145
industri 4143
covidfre 4140
later 4131
anywher 4122
tire 4122
earth 4119
request 4115
wednesday 4105
trip 4093
weight 4079
depot 4070
anti 4062
royal 4059
border 4050
adult 4049
bro 4033
period 4025
wow 4021
realiti 4008
basic 4002
it 3993
general 3985
respect 3984
bank 3981
tv 3972
hasnt 3971
lock 3968
sneez 3958
heard 3957
within 3956
island 3955
short 3952
honest 3942
@donwinslow 3940
celebr 3934
effort 3933
america 3931
dad 3930
17 3921
boy 3919
financi 3914
flatten 3913
lack 3913
special 3908
antibodi 3903
accept 3902
pair 3902
schedul 3902
model 3901
@sarahcpr 3889
couldnt 3886
#trumpvirus 3883
dc 3882
fan 3881
scare 3881
@davenewworld_2 3867
simpl 3863
april 3858
beirut 3858
author 3857
fun 3855
wealth 3845
hide 3830
hi 3821
chief 3817
nyc 3810
grandmoth 3806
strategi 3806
park 3804
led 3794
cloth 3789
definit 3783
figur 3783
welcom 3774
wore 3763
nobodi 3756
fox 3755
297 3754
meanwhil 3752
harm 3744
type 3742
deni 3741
have 3736
shoot 3734
bit 3727
colleg 3720
throw 3720
violat 3716
min 3715
hero 3711
7 3710
@realjameswood 3708
drive 3706
perfect 3697
straight 3687
physic 3686
note 3685
wage 3684
conduct 3683
approach 3671
spot 3667
lower 3658
skin 3655
karen 3654
music 3646
surpris 3643
our 3634
six 3634
jair 3622
russia 3621
@rbreich 3620
prime 3619
enter 3617
has 3614
jeff 3614
05 3612
daughter 3603
transmiss 3597
limit 3596
higher 3579
95 3573
date 3567
correct 3558
centr 3556
100% 3554
recommend 3553
@bigogkob 3552
omg 3551
quit 3549
smart 3548
appear 3547
urg 3544
135 3538
stimulus 3537
site 3536
choic 3534
ca 3533
this 3532
conspiraci 3527
pelosi 3527
shouldnt 3525
write 3523
pick 3518
admin 3516
appli 3515
eye 3513
addit 3507
intern 3505
150 3504
disappear 3491
shame 3485
notic 3480
drink 3477
aid 3472
ram 3469
tractor 3468
track 3467
whos 3467
militari 3466
carri 3460
excus 3457
sound 3451
2.001k 3442
miller 3441
nhs 3441
bbc 3439
pitch 3437
declin 3431
hong 3429
all 3427
footbal 3425
reveal 3422
anthoni 3416
app 3415
australia 3415
theyv 3413
washington 3412
remot 3409
front 3398
prove 3397
except 3391
ralli 3390
nice 3389
hot 3372
@berniesand 3371
john 3371
repeat 3366
after 3365
de 3359
becam 3358
@aslavitt 3356
billion 3356
grow 3351
panel 3350
aint 3345
groceri 3343
justic 3343
advic 3340
encourag 3340
rerout 3337
400 3327
27 3325
oper 3325
bezo 3317
exampl 3312
view 3307
dog 3304
youtu.b 3301
monday 3297
brought 3293
sell 3293
wall 3292
comment 3291
blue 3288
red 3288
clean 3285
murder 3285
4m 3278
piec 3276
@jsolomonreport 3271
term 3267
london 3264
pictur 3263
who 3263
facebook 3262
mad 3262
natur 3259
oval 3255
extra 3248
detail 3245
five 3245
arrest 3242
ox 3239
wife 3236
45 3235
@drericd 3235
@dknight10000 3234
shield 3233
solut 3231
@drdavidsamadi 3229
regist 3226
afford 3225
congressmemb 3223
along 3220
add 3217
politician 3217
@mmpadellan 3208
fit 3206
phone 3206
youll 3206
compar 3205
potenti 3203
stage 3199
employ 3192
kong 3184
asymptomat 3180
trib.al 3180
men 3179
budget 3178
31 3175
chart 3174
touch 3172
ford 3166
trend 3164
raiser 3154
@speakerpelosi 3151
@aoc 3141
damag 3141
moment 3138
indian 3137
sarscov2 3131
stock 3130
mention 3128
exempt 3124
none 3117
sight 3117
easili 3116
michigan 3112
movi 3110
organ 3105
aug 3103
brother 3090
jul 3081
combin 3079
trade 3078
largest 3072
so 3071
declar 3066
sweden 3065
by 3061
mitch 3057
prayer 3056
selfish 3056
gather 3049
multipl 3036
dollar 3033
town 3033
comprehend 3031
debat 3031
ahead 3025
80 3023
29 3021
nj 3016
field 3015
attent 3014
frustrat 3005
obvious 3001
collect 3000
breaking 2999
evict 2996
spokesman 2995
whilst 2995
crime 2987
ow.li 2987
beyond 2986
design 2985
manufactur 2985
incom 2982
rapid 2982
rent 2982
assist 2979
tool 2974
promot 2972
oxford 2964
wanna 2963
remdesivir 2960
involv 2957
lebanon 2945
certain 2944
abus 2941
regard 2941
ur 2933
apart 2928
unfortun 2928
climat 2925
laugh 2920
tori 2919
#staysaf 2914
refer 2910
sen 2908
2.021k 2907
proud 2906
stuff 2900
size 2896
europ 2893
purpos 2888
phase 2887
jail 2883
arriv 2881
regular 2881
transport 2880
initi 2874
postpon 2873
shift 2872
teach 2868
publish 2867
pull 2867
gave 2864
accur 2861
#wearamask 2860
produc 2856
shock 2854
20s 2850
appar 2844
cold 2835
ten 2835
viral 2834
surround 2831
you 2831
condom 2825
fatal 2819
tragic 2818
blm 2817
signific 2811
@dbongino 2809
elder 2809
germani 2803
averag 2797
modi 2796
beauti 2795
statement 2795
8 2788
shower 2787
self 2785
equal 2775
liber 2775
weird 2774
gain 2771
till 2771
investig 2770
mail 2770
corpor 2766
capit 2765
wrote 2755
combat 2753
stabil 2753
@nygovcuomo 2752
stat 2750
anim 2744
indoor 2743
kickback 2736
heartbreak 2731
everybodi 2727
cancer 2725
former 2722
itali 2720
gym 2718
incompet 2715
theguardian.com 2714
societi 2712
novemb 2711
@acosta 2706
husband 2706
theori 2706
threaten 2704
michael 2703
@_vicpic 2696
canadian 2693
option 2691
known 2688
pose 2682
judg 2681
moron 2680
israel 2678
sale 2677
solv 2677
attempt 2675
immedi 2674
worldwid 2674
1st 2670
outdoor 2669
vulner 2669
now 2668
although 2666
height 2666
individu 2662
60 2654
album 2653
arm 2653
@chuckcallesto 2652
out 2648
san 2641
mouth 2640
deep 2639
tip 2639
t. 2635
somehow 2634
wuhan 2632
dark 2629
door 2628
info 2623
throughout 2623
brain 2621
song 2621
strip 2620
star 2618
suppress 2616
west 2616
#pandem 2615
collaps 2611
plus 2607
gotten 2604
tough 2604
perform 2602
race 2600
magic 2599
professor 2599
promis 2599
voter 2598
propaganda 2597
present 2593
howev 2592
mistak 2588
peac 2587
1000 2582
mexico 2580
rt 2580
convers 2579
depress 2578
diagnos 2578
invest 2577
kashmir 2575
cool 2574
super 2574
hurt 2572
okay 2570
profit 2569
fyi 2564
@whitehous 2563
older 2558
idk 2557
board 2554
victim 2554
dumb 2552
father 2546
fda 2543
alert 2541
connect 2536
resourc 2532
irish 2531
echobox 2526
mike 2521
@felipeneto 2517
execut 2512
la 2512
slot 2512
cross 2505
@nytopinion 2502
disgust 2502
plane 2502
28 2501
bless 2501
awar 2499
complain 2499
@sakotadag 2497
insur 2497
strengthen 2497
grant 2492
hurrican 2492
cage 2491
dose 2491
toward 2487
#echobox 2483
medicin 2482
equip 2480
#lockdown 2478
selfquarantin 2478
choos 2476
navajo 2475
can 2474
andrew 2469
nazi 2467
russian 2464
difficult 2459
file 2459
truli 2459
@narendramodi 2452
digit 2452
disabl 2452
region 2451
stress 2451
shutdown 2446
urgent 2441
armi 2436
gat 2436
crimin 2430
@thehil 2428
gentleman 2428
target 2426
guard 2423
2.019k 2420
form 2415
dozen 2413
scientif 2412
consecut 2410
googl 2407
rubbish 2401
franc 2400
screen 2399
illeg 2394
moderna 2392
appreci 2390
confer 2386
arkansa 2385
matt 2385
trump's 2380
disney 2374
payment 2374
assess 2369
eu 2368
ron 2367
spin 2366
insan 2364
sex 2359
99 2356
skip 2355
hopkin 2353
cousin 2352
suspect 2350
pls 2347
minor 2345
art 2341
improv 2338
mild 2335
55 2334
fix 2332
@nytim 2331
@tomfitton 2331
familiar 2328
wed 2327
mandir 2325
januari 2322
fair 2319
kiss 2319
racism 2319
anyway 2314
but 2314
capac 2314
facemask 2313
nba 2312
impos 2311
precaut 2310
philippin 2306
100000 2305
light 2305
third 2304
everyday 2303
rep 2302
review 2299
70 2292
wide 2291
gilead 2290
fault 2287
1m 2285
exclus 2285
an 2279
host 2279
@youtub 2278
@gop 2277
aberdeen 2277
twice 2270
hotel 2269
role 2267
nigga 2257
pub 2254
brett 2251
funni 2250
ridicul 2250
tf 2250
petit 2243
engag 2240
5g 2236
often 2235
cook 2234
passion 2234
fee 2233
met 2231
shape 2228
defund 2216
ohio 2216
hire 2214
roll 2209
airlin 2208
box 2200
greatest 2200
bullshit 2197
necessari 2196
fill 2195
homeschool 2195
midst 2194
resign 2194
anymor 2192
swab 2192
zealand 2192
advis 2191
saturday 2189
swastika 2189
35 2187
@depressicaxo 2187
ne 2187
picsi 2186
gujarat 2184
mortal 2184
56m 2182
implement 2181
ov 2181
simpli 2181
smell 2180
patriot 2178
wh 2175
bounti 2174
miami 2172
#mask 2171
incred 2168
democraci 2167
process 2165
ladi 2162
65 2157
00 2156
held 2154
mine 2154
warrior 2154
britain 2151
forgot 2149
palm 2149
factor 2148
cat 2147
bitch 2146
institut 2144
nationwid 2144
statist 2141
campus 2133
wet 2132
dine 2131
orlando 2130
goal 2127
tim 2125
central 2123
immigr 2122
lmao 2119
impress 2118
profession 2112
artist 2110
dispos 2108
victoria 2107
associ 2105
random 2102
chicago 2101
folklor 2099
maskless 2099
ordeal 2099
letter 2095
senior 2094
hair 2092
william 2091
48 2088
570 2088
ground 2087
@charliekirk11 2086
sudden 2085
angel 2083
bts 2083
cmp 2083
discov 2083
protocol 2081
racial 2078
proof 2076
therapi 2074
tabl 2073
if 2068
devast 2067
rich 2064
machin 2061
usual 2061
blasio 2058
bihar 2057
fli 2057
tech 2055
excit 2052
sa 2051
suck 2051
stamp 2048
engin 2047
los 2047
570k 2046
whatev 2045
experienc 2044
lung 2044
agenda 2040
bangtan 2040
was 2039
blog 2037
en 2032
over 2031
origin 2025
prior 2025
doubt 2024
seek 2023
@bigdaddyvinz 2017
birthday 2016
seri 2015
n95 2011
overwhelm 2010
gun 2008
communist 2007
guarante 2007
bet 2005
conserv 2005
fed 2005
own 2005
lou 2002
pretend 2002
nick 2000
wast 2000
ya 1997
earn 1996
glove 1993
stadium 1992
prioriti 1991
explos 1990
horror 1990
scam 1989
finish 1988
secretari 1985
eloqu 1983
@kylegriffin1 1980
energi 1980
nichola 1977
outrag 1973
voic 1973
#covid-19 1972
@nbcnew 1970
began 1970
afraid 1966
@reuter 1965
bunch 1964
pool 1962
camp 1961
@skynew 1960
ongo 1960
thursday 1960
independ 1959
spanish 1959
aldi 1956
station 1956
pentagon 1955
seven 1955
@saracarterdc 1952
gas 1952
@itswilliamston 1949
agenc 1947
most 1946
portland 1946
partner 1945
terribl 1943
amongst 1941
brand 1940
constitut 1934
council 1931
teen 1931
#covidiot 1930
technolog 1930
benghazi 1929
na 1928
sink 1926
identifi 1923
jersey 1921
respiratori 1920
theyll 1920
british 1918
german 1918
medicar 1918
mumbai 1918
owner 1914
road 1913
admiss 1912
email 1912
wild 1912
cell 1911
potus 1911
dream 1909
fool 1906
rubber 1905
170 1904
websit 1904
commit 1900
page 1899
lakh 1898
express 1895
meant 1895
gotta 1888
defin 1887
antimask 1886
david 1886
invit 1886
leagu 1886
volunt 1886
cough 1883
@govrondesanti 1881
nigeria 1881
airport 1880
particip 1876
hello 1875
oxygen 1872
newsweek.com 1869
cum 1868
penc 1866
survey 1865
anthony 1863
king 1862
progress 1859
# 1858
excel 1857
ccp 1854
recess 1854
135000 1853
hom 1853
civil 1850
hrs 1850
undoubt 1847
growth 1842
grubhub 1841
1.918k 1840
pain 1840
#stayhom 1839
mix 1839
rush 1839
just 1838
checkpoint 1835
crash 1834
accus 1833
@pmoindia 1831
maintain 1831
troop 1830
coronaviruss 1827
jr 1820
boost 1819
expand 1818
politic 1818
#break 1814
assum 1812
aw 1811
driver 1811
when 1811
cri 1809
non 1809
4th 1807
med 1806
pack 1805
under 1804
detect 1803
webinar 1801
blow 1800
330 1799
premier 1799
legal 1795
un 1794
ballot 1790
utm_term 1785
shortag 1781
confus 1779
@johncardillo 1776
forev 1776
surgeri 1774
bs 1773
bubbl 1773
standard 1773
lesson 1770
covidiot 1769
misinform 1769
land 1766
am 1765
di 1764
unsaf 1763
load 1762
ap 1761
@potus 1758
yup 1758
kane 1756
passeng 1756
@nick_kapur 1755
argu 1753
discharg 1753
dude 1753
insist 1753
arrow 1751
slush 1751
nauseat 1750
jacksonvill 1748
peak 1747
@drsimonegold 1746
than 1746
#sarscov2 1744
empti 1742
achiev 1741
chain 1740
taxpay 1740
tx 1740
@msnbc 1739
cm 1737
gt 1735
soul 1734
rumbl 1733
bolsonaro 1732
wisconsin 1731
migrant 1727
rose 1727
ireland 1726
consequ 1725
sector 1724
decad 1723
amazon 1722
epidem 1722
physician 1722
adapt 1721
comfort 1721
highlight 1719
jan 1719
compulsori 1718
speed 1718
southern 1717
candid 1716
alarm 1715
ontario 1711
swine 1711
athlet 1710
sing 1710
mess 1708
181 1707
fever 1706
credit 1704
ruin 1704
secret 1704
maryland 1702
paul 1702
sampl 1702
inject 1700
bitcoin 1698
document 1698
mcdonald 1698
tir 1697
defend 1694
introduc 1694
kpoppi 1694
analysi 1692
inflat 1692
72 1690
yr 1690
nbc 1689
winner 1689
estim 1688
grader 1687
headlin 1686
@yungmiami305 1685
liar 1685
cite 1684
putin 1682
stream 1681
@samjonesmcr 1680
foreign 1680
lord 1680
narrat 1679
complic 1678
@seanhann 1677
japan 1677
32 1676
downplay 1675
valu 1675
scream 1673
sarah 1668
ship 1668
hhs 1667
orang 1666
melbourn 1665
sturgeon 1665
kit 1664
pic 1664
067 1663
lift 1663
cash 1662
shopper 1662
@sethabramson 1657
african 1657
desper 1657
halloween 1656
ball 1655
sometim 1655
greater 1653
ift.tt 1653
anxieti 1652
instruct 1652
jesus 1652
exposur 1651
loan 1651
homeless 1649
felt 1646
@cdcgov 1639
90 1638
virginia 1636
uncl 1634
ceo 1632
evil 1632
tom 1632
round 1630
150000 1629
th 1629
grate 1625
pharma 1624
previous 1624
@drdenagrayson 1623
otherwis 1622
33 1621
@ingrahamangl 1621
locat 1621
certif 1618
domin 1616
ethiopian 1615
card 1614
#trump 1613
click 1611
doc 1611
jason 1611
attribut 1610
ice 1610
purchas 1610
communic 1607
cultur 1602
ji 1597
content 1596
distract 1596
platform 1596
catastroph 1595
mf 1593
brexit 1590
youth 1590
vacat 1589
#corona 1586
odd 1584
grand 1583
pressur 1581
isra 1580
surgic 1580
manipul 1578
united 1578
repres 1575
rage 1574
suit 1574
3% 1573
feed 1573
strict 1572
verifi 1571
entri 1569
@cbsnew 1567
buff.li 1565
favorit 1565
rip 1564
flaw 1560
wtf 1559
trick 1558
@senatemajldr 1557
oppon 1557
nevada 1556
propos 1554
supermarket 1553
green 1552
particular 1552
pakistan 1551
novel 1550
soldier 1550
ward 1550
dure 1549
pop 1549
firm 1548
winter 1548
quiet 1547
mp 1546
inperson 1545
interact 1545
maga 1544
3rd 1543
closer 1543
sun 1543
1.2k 1542
@borisjohnson 1541
guid 1541
cop 1536
session 1536
whose 1536
inequ 1533
skew 1533
contribut 1532
panic 1531
ticket 1530
distribut 1529
plough 1529
plz 1529
@erictrump 1528
flood 1525
minnesota 1525
suprem 1524
fac 1523
beg 1522
coach 1521
about 1520
complex 1517
speaker 1517
04 1515
motiv 1514
pocket 1514
smoke 1513
danc 1512
@snoblifeken_ 1510
channel 1510
47 1509
generat 1507
houston 1507
observ 1507
down 1505
wale 1505
52 1503
tourist 1503
classroom 1502
droplet 1501
tag 1499
shatter 1498
violenc 1498
easier 1497
environ 1496
labour 1495
reelect 1492
burn 1490
emot 1488
alabama 1487
hack 1487
argument 1486
dispar 1485
intrud 1484
youd 1484
@ewarren 1482
he 1481
fresh 1480
@bocxtop 1479
spray 1478
temporari 1478
ministri 1477
46 1475
scott 1475
similar 1475
antigay 1474
100m 1472
desir 1472
@_mateomontana_ 1471
ravag 1471
iran 1470
obstacl 1469
cluster 1468
neglig 1468
exercis 1466
statewid 1466
tour 1465
duti 1460
t.c 1460
pathet 1457
@tedlieu 1456
cas 1456
finna 1456
@reallyamerican1 1454
journalist 1452
layer 1452
proven 1452
veteran 1450
shithol 1449
award 1448
hug 1447
troubl 1447
recogn 1446
mahesh 1444
ki 1442
36 1441
@yamich 1441
brazilian 1441
instal 1441
resist 1441
@realcandaceo 1439
stone 1439
34 1438
chat 1438
bus 1437
tulsa 1435
defens 1434
horribl 1430
10x 1429
convinc 1427
floyd 1426
primari 1425
autofe 1424
10000 1423
closur 1420
cnn.com 1420
commission 1420
stick 1420
bag 1419
network 1416
sam 1416
through 1416
deliveri 1415
rapert 1415
robert 1415
bridg 1413
escap 1413
confid 1412
specif 1412
musti 1411
hang 1410
replac 1410
window 1409
bigger 1407
atleast 1406
assault 1405
intellig 1405
perhap 1404
prescrib 1404
shoe 1402
competit 1401
compli 1401
fellow 1401
#facemask 1400
anybodi 1399
blast 1399
tackl 1398
bought 1397
kim 1397
rabid 1396
code 1394
420 1393
broke 1393
inspir 1393
rough 1393
ride 1392
justthenews.com 1391
chili 1389
hotspot 1388
labor 1388
steal 1388
50% 1387
constant 1386
inmat 1385
ideologyand 1384
reject 1383
agent 1382
icymi 1382
upon 1382
scandal 1381
75 1380
@alexberenson 1378
25% 1377
amidst 1376
parad 1376
sinclair 1375
committe 1374
acceler 1372
commiss 1372
longterm 1372
shree 1371
advoc 1369
doja 1369
graduat 1369
@who 1368
suicid 1368
prefer 1367
heat 1366
clarifi 1365
sort 1365
9% 1364
practice 1364
singh 1363
eas 1362
programm 1359
nicola 1358
influenc 1357
nytimes.com 1357
mile 1354
700 1351
papad 1351
plagu 1351
#maskup 1349
coffe 1349
worn 1349
babu 1348
broadcast 1347
entertain 1346
slam 1345
traffick 1344
youtub 1344
msm 1343
grade 1342
cooper 1340
describ 1340
hypocrit 1340
smile 1340
zinc 1337
newsom 1336
drove 1335
chair 1334
donor 1334
skill 1334
muslim 1333
disrupt 1331
@swamy39 1330
european 1327
soar 1327
pres 1326
444 1325
buck 1325
korean 1324
liberti 1323
alleg 1322
whit 1322
bereav 1320
radio 1320
worsen 1320
storm 1318
tho 1316
#quarantin 1314
@washingtonpost 1314
nigerian 1313
colleagu 1311
edit 1311
devil 1310
gavin 1308
opposit 1308
coverag 1306
itll 1305
@realmattcouch 1304
transpar 1304
victori 1303
perman 1302
@renao 1301
glass 1300
bout 1299
jump 1298
memori 1298
maskwear 1297
nonsens 1296
rawstory.com 1296
@drrpnishank 1295
birth 1294
birx 1293
appoint 1291
flag 1291
kennedi 1291
transfer 1291
581 1290
zoom 1290
ab 1289
#socialdistanc 1288
stuck 1288
visitor 1287
row 1286
banksi 1285
infecti 1283
reaction 1283
@realtuckfrump 1282
jim 1282
western 1282
impeach 1276
lo 1276
16% 1274
co 1274
dm 1273
plandem 1273
shout 1273
stunt 1273
@cl0uds_9 1272
barr 1271
pa 1269
takeaway 1267
cycl 1266
145 1265
internet 1264
#covid__19 1263
prais 1263
staysaf 1261
@trumprulzz 1259
transmit 1259
career 1258
piss 1258
scari 1255
unlik 1255
destruct 1252
bare 1251
journal 1251
lunch 1250
disinfect 1249
expens 1248
taid 1248
reli 1247
strike 1247
mari 1246
unabl 1243
weapon 1242
innov 1241
puerto 1240
vietnam 1240
crap 1239
granddaught 1238
compart 1236
bore 1235
trueanthem 1235
bloodi 1233
defi 1233
karnataka 1233
ugli 1232
wise 1232
@davidschneid 1231
84 1230
bday 1230
kinda 1229
logic 1229
spit 1229
already 1225
rural 1225
terrifi 1225
toppl 1225
useless 1225
@simondolan 1224
relax 1224
throat 1224
freak 1223
februari 1222
counter 1221
nfl 1221
seat 1220
camera 1219
bother 1217
tune 1217
femal 1216
where 1216
hancock 1215
thru 1215
taught 1213
provinc 1212
sooo 1212
survivor 1212
2.018k 1210
fewer 1209
rape 1209
search 1209
3a+trending+cont 1208
pat 1208
ted 1208
tear 1207
aka 1205
et 1205
sheep 1205
sooner 1205
2000 1204
disgrac 1204
enemi 1204
histor 1204
mar 1203
obes 1203
apolog 1202
scamdem 1202
terror 1202
fashion 1201
@spectatorindex 1199
french 1198
georg 1198
resum 1198
#new 1197
1.6% 1197
draw 1197
influenza 1197
imag 1195
debt 1194
translat 1194
@catturd2 1193
spoke 1193
@thomas1774pain 1192
color 1190
@davidcorndc 1189
their 1189
map 1188
pneumonia 1188
queen 1188
vital 1188
function 1187
incorrect 1185
@gatewaypundit 1182
behavior 1182
separ 1181
imposs 1180
spring 1179
43 1178
rnc 1178
utter 1178
relationship 1177
pradesh 1174
er 1173
liv 1173
ellen 1171
favr 1169
mobil 1169
cruz 1168
@mitchellvii 1167
fabric 1167
79 1166
loot 1166
australian 1165
perspect 1165
weak 1165
expir 1164
@govmikedewin 1163
i 1162
determin 1159
2300 1158
brown 1158
reflect 1158
266 1157
dick 1157
realis 1156
bypass 1155
hardest 1155
angri 1154
congratul 1154
nov 1154
vp 1154
built 1153
funer 1152
match 1152
rock 1152
iraq 1151
chuck 1150
english 1148
neighbor 1147
qualiti 1147
tie 1147
legisl 1146
rico 1142
client 1141
minimum 1141
3100 1139
revis 1139
@abc 1138
plant 1138
guest 1137
detroit 1136
gold 1136
style 1136
download 1135
instagram 1135
0 1133
120 1129
wearer 1129
asshol 1128
genuin 1128
abc 1127
lawyer 1127
rivera 1127
monitor 1126
terrorist 1126
wit 1126
degre 1125
169 1124
asia 1124
pre 1124
statu 1124
cuz 1123
recal 1121
talli 1121
arjun 1120
plate 1119
@cia 1118
@teapainusa 1118
mps 1118
pandemic 1115
swamp 1115
knowledg 1114
overal 1114
poverti 1114
yo 1114
quot 1113
remark 1113
heal 1112
dedic 1110
kentucki 1109
nanci 1108
cope 1105
movement 1105
label 1104
subject 1104
vaccine 1103
coordin 1102
scrambl 1099
yep 1099
scenario 1098
curb 1097
boss 1096
redhand 1096
fantast 1095
hypocrisi 1095
properti 1095
tourism 1095
trump2020 1095
financ 1094
eventu 1093
md 1093
reuters.com 1093
123 1092
marshal 1089
rajasthan 1088
bbnaija 1087
dept 1087
exceed 1087
kenya 1087
neither 1087
mil 1086
c 1085
colorado 1082
equiti 1082
creativ 1081
rid 1081
az 1080
reserv 1080
nightmar 1079
whoever 1079
confront 1078
user 1078
acknowledg 1076
appl 1076
domest 1076
insight 1076
upset 1075
10m 1073
irrespons 1073
khan 1073
broken 1072
@cnnbrk 1071
hyderabad 1071
national 1071
error 1070
scheme 1070
@valentineshow 1068
ah 1068
nail 1068
somebodi 1068
@ani 1067
cute 1067
indic 1067
flip 1065
accuraci 1064
90% 1063
@senschum 1063
gift 1063
johns 1063
master 1063
pro 1062
mitig 1061
adopt 1060
util 1059
nut 1058
amend 1057
hall 1057
punish 1057
soci 1057
stanley 1057
se 1055
160 1054
800 1054
redund 1054
@patreasur 1053
#remotework 1052
37 1052
establish 1051
hill.cm 1051
sexual 1051
epidemiolog 1050
oil 1050
unpreced 1050
altern 1049
@gavinnewsom 1048
explan 1048
sainsburi 1046
weather 1046
henri 1044
traitor 1044
carolina 1043
cheer 1043
demonstr 1043
gibb 1043
n 1043
his 1042
richest 1042
valley 1042
eight 1041
bbc.co.uk 1040
devo 1040
chris 1039
@repandybiggsaz 1038
garden 1037
antifa 1036
cotton 1036
zone 1036
brutal 1035
crush 1035
decreas 1035
#texa 1034
400000 1034
unbeliev 1033
ultim 1032
ai 1031
chao 1031
343 1030
adjust 1030
rn 1030
consist 1029
@shamscharania 1028
christian 1027
gross 1027
@arvindkejriw 1026
popular 1025
advanc 1024
cabinet 1024
organis 1021
rare 1021
silent 1021
against 1020
applic 1018
coronavirusiot 1018
@public_citizen 1017
brave 1017
consum 1017
nightsthi 1016
al 1015
killer 1013
select 1013
revenu 1012
score 1012
vip 1012
do 1011
sold 1011
were 1011
billionair 1010
covid__19 1010
filter 1010
250 1009
wipe 1009
workplac 1009
household 1008
split 1008
wearing 1007
mock 1006
01 1005
60% 1005
alcohol 1005
bay 1005
millionair 1005
occur 1005
speech 1004
chinese 1003
silenc 1003
dewin 1002
asian 1001
brilliant 1001
faith 1001
inquiri 1001
screw 1001
abil 1000
holi 999
personnel 999
peter 998
detent 996
patent 996
hole 994
38 992
@latim 991
nih 991
pregnanc 991
500000 990
complaint 989
january 989
texan 989
ip 988
print 988
lawsuit 987
@repkatieport 986
basement 986
grandma 986
reusabl 986
@respexi 984
favor 984
strang 984
cbsn.ws 982
item 982
ocid 982
planet 981
chariti 980
inde 978
foundat 976
ft 975
lowest 975
advantag 974
strain 974
spi 973
5th 972
homemad 972
routin 971
written 971
1% 970
bail 969
deliber 969
disappoint 968
#maga 967
math 967
tea 967
adam 965
context 965
@nyshuffl 964
forcing 963
react 963
49 962
baba 962
ivf 961
@davidick 960
atlanta 960
nsw 960
2.016k 959
abt 958
awesom 958
roger 958
146 957
hillari 956
scottish 956
topic 955
enabl 954
gap 954
rioter 954
130 953
dramat 953
version 953
floridian 951
typic 951
@devisridhar 950
religi 950
@ic 949
clown 949
bhumi 948
ord 948
norm 947
ak47 946
indigen 946
latimes.com 945
transit 945
mississippi 944
cov 943
mfs 943
templ 943
ran 942
@evanfoxi 940
insta 940
max 940
glasgow 939
ni 939
mysteri 938
@matthancock 937
tank 937
@busi 936
masks 936
studio 936
trap 936
ed 935
btw 934
explor 934
rang 934
wfh 934
phoni 933
abbott 932
scale 932
jo 931
@yanke 930
wouldv 929
harder 928
reckless 928
sar 928
sidelin 928
tw 928
parliament 927
sona 927
hygien 926
instagram.com 926
paus 926
chicken 925
fascist 925
pure 925
sacrific 925
signal 925
vast 925
39 924
cent 923
mum 923
tube 923
plenti 922
arrang 921
mate 919
tl 919
toni 919
@mike_p 918
humanitarian 918
#indiafightscorona 917
divid 917
#coronaviruspandem 916
extens 916
lucki 916
negoti 915
@urstrulymahesh 914
feb 914
mere 914
bear 913
cnn.it 913
arsenal 912
housem 912
lawn 912
surgeon 912
sustain 912
dare 911
ear 911
lemm 911
text 911
#hcq 910
indefinit 910
dilig 909
safer 909
sec 909
mnuchin 907
@janicedean 906
blind 906
mn 906
#india 905
40% 905
dinner 905
moral 905
me 904
pr 904
110 903
calm 903
myth 902
shelter 902
younger 902
300000 901
98% 901
minister 901
singleday 901
@foxnew 900
fat 900
sc 900
80% 899
@roddyricch 899
crew 899
warp 899
bottom 898
chill 898
huh 898
regardless 898
@craig_a_spenc 897
modern 897
112 896
suspend 896
9th 895
denial 895
guardian 895
jong 895
@presssec 894
con 894
crippl 894
sum 894
50000 893
maharashtra 893
truck 893
cal 892
coward 892
@nicolasturgeon 891
belgium 891
fallen 891
igshid 891
#bbnaija 890
nope 890
postcovid 890
contagi 889
facecov 889
hat 889
naya 889
annual 888
presidenti 888
sat 888
transform 888
remotework 887
subscrib 887
20% 886
pregnant 886
paralyz 885
whitmer 885
consider 884
maxwel 884
quarter 884
a.msn.com 882
bonus 882
brit 882
hanna 882
aim 880
alli 879
honor 879
northern 879
vice 879
#hydroxychloroquin 878
@dougducey 875
elit 875
lethal 874
furlough 873
bust 872
wax 872
2.0k 870
42 870
concert 869
narcissist 868
rain 868
@lil_deduct 866
shapp 866
outright 865
shake 865
125 864
retir 864
jame 863
toxic 863
activist 862
assur 862
blair 862
jake 862
afghanistan 861
boom 861
mlb 861
comeback 860
languag 860
materi 860
epicent 859
meal 859
occupi 859
thalapathi 859
#usa 858
#workfromhom 858
@hopeggukki 858
balanc 858
59 857
abort 857
display 857
appeal 856
faster 856
grasp 855
struck 855
@atensnut 853
dictat 853
hysteria 853
kushner 853
regim 852
hawaii 851
upd 851
wellb 851
31% 850
mascara 850
wing 850
150k 849
@7tine76 849
climb 849
ga 849
mainstream 848
while 848
1067 845
carv 845
collabor 845
glow 845
stun 845
@guardian 844
virologist 844
@nedryun 843
abroad 842
da 842
investor 841
#coronavirusupd 840
actor 839
mak 839
frequent 838
privileg 837
male 836
harri 835
@tristantaylor88 834
curfew 834
cult 833
hazard 832
sonu 832
germ 831
appropri 829
spirit 829
@senkamalaharri 828
excess 828
iron 828
selfi 828
@tedcruz 827
databas 827
equival 826
indiana 826
cbs 825
yorker 825
asap 824
fuel 824
solidar 824
@emeraldrobinson 823
farm 823
giant 823
hann.it 823
bike 822
defam 822
mislead 822
nativ 822
soap 822
ghislain 821
compet 820
crack 820
mel 820
bottl 819
oral 819
lawmak 818
neet 818
construct 817
tran 817
41 816
sky 816
supreme 816
utm_cont 816
cbse 815
justifi 815
taiwan 815
temperatur 815
tylenol 815
@trumpwarroom 814
arrog 814
cheat 814
costa 814
fb 814
somewher 814
@donaldjtrumpjr 813
gibson 813
profound 813
stagger 813
#vaccin 812
county 812
grim 812
octob 812
outcom 812
114 811
asthma 810
#blood 809
@benshapiro 809
compon 809
145000 808
inept 808
chin 807
resili 807
academ 806
begun 806
opt 806
each 803
therapeut 803
empathi 802
televis 802
elementari 801
frank 801
lay 800
sood 800
@hkrassenstein 799
christ 799
erad 799
su 799
bio 798
fr 797
#mtvhottest 796
2333 796
@xkcdcomic 796
mishandl 796
shutter 796
underwear 796
#stayathom 795
1000s 795
deploy 795
joy 795
laid 795
m.xkcd.com 794
rs 794
unnecessari 793
@brittn3y33 792
@pbhushan1 792
aggress 792
sake 792
#florida 791
em 790
kay 790
10181 789
band 789
tyranni 789
ciara 788
medical 788
@bbcnew 787
loser 787
besid 786
complianc 786
telangana 786
inaccuraci 785
15th 784
julio 784
off 784
cheap 783
crore 783
dress 783
poison 783
whenev 782
forgotten 781
lap 781
lectur 781
sushant 781
carrier 780
cafeteria 779
#china 778
@miafarrow 778
jare 778
@chrislhay 777
@joenbc 777
saf 777
20th 776
bean 776
metro 776
@erictopol 775
nah 775
atlant 774
infrastructur 774
tone 774
dey 773
abandon 772
minim 772
trp 772
kashmiri 771
path 771
washabl 771
#wearadamnmask 770
@hrdministri 770
anytim 770
floor 769
staffer 769
genocid 768
nomin 768
widespread 768
overinfl 767
screenshot 767
@clarkemicah 766
applaud 766
curious 766
mismanag 766
re 766
therefor 766
85 765
born 765
city 764
factori 764
intens 764
resolv 764
tennesse 764
dec 763
object 763
silver 763
sincer 763
accid 762
boat 762
times* 762
villag 762
*three 761
sue 761
wisdom 761
135000000000 760
tamil 760
victorian 760
139 759
randi 759
toronto 759
coloss 758
henry 758
monster 758
pleasur 758
shri 758
vibe 758
whi 758
workfromhom 758
coronavirus19 757
foodbank 757
consult 756
fundrais 756
uddhav 756
#health 755
haha 755
advertis 754
assembl 753
electr 753
@thejayburn 752
coop 752
discredit 752
disproportion 752
rant 752
anc 751
commerci 751
nat 751
innoc 750
odisha 750
paint 750
theatr 750
@teamtrump 749
couldv 749
courag 748
grab 748
lake 748
wolf 748
autist 747
cannon 747
corner 747
cruis 747
discrimin 747
doug 747
hunger 747
las 747
@laracrabb 746
annoy 745
giveaway 745
rank 745
various 745
@bts_twt 744
upcom 744
intend 743
kaduna 743
revolut 743
sickest 743
flat 742
asid 741
should 741
spokesperson 741
comput 740
hai 740
mann 740
pointless 740
trash 740
ang 739
navarro 739
neighborhood 739
rio 739
scene 739
prompt 738
hr 737
marri 737
revers 737
@peterstefanovi2 736
forecast 736
smh 736
brennan 735
ie 735
lapdog 735
meme 735
737 734
900 733
divis 733
knock 733
dan 731
breach 730
compass 730
house 730
tender 730
ton 730
wind 730
cashapp 729
sp 729
capabl 728
hanuman 728
restart 728
thumb 728
va 728
welfar 728
82 727
@annvandersteel 727
credibl 727
religion 727
10% 726
138 726
crucial 726
telecast 726
310 725
basi 725
jack 725
permit 725
incarcer 724
inexpens 723
quickest 723
founder 722
smith 722
titl 722
devic 721
injuri 721
chose 720
illinoi 720
ig 719
richard 719
@cnbc 718
museum 718
30% 717
@walmart 717
festiv 717
moratorium 717
#wfh 716
childcar 716
debunk 716
karma 716
p 716
woke 716
agreement 715
betsi 715
r 715
shall 715
valid 715
dump 714
mill 714
ration 714
slap 714
@repswalwel 713
bruh 713
ffs 713
section 713
sole 713
beer 712
#backtoschool 711
cardigan 711
reut.r 711
trudeau 711
hatr 710
librari 709
tracer 709
offens 708
attitud 707
backtoschool 707
gilbert 707
@jaketapp 706
cast 706
genius 706
06 705
146000 705
lil 705
snd 705
unleash 705
#facecov 703
greeter 703
@loudobb 702
boris 702
driven 702
fbi 701
prof 701
youngest 701
bang 699
bibl 699
fuckin 699
hadnt 699
ivey 699
latin 699
plastic 699
rat 697
uniqu 697
@poregan 696
fifth 696
numb 696
pennsylvania 695
tesco 695
theri 695
wherea 695
@ivankatrump 694
@roywoodjr 694
azerbaijan 694
boycott 694
hill 693
journey 693
mode 693
yanke 693
@incindia 692
144 691
@deanna4congress 691
@drzwelimkh 691
66 690
unaccept 690
@sardesairajdeep 689
bold 689
clinton 688
covid 688
don't 688
trigger 687
vijay 687
27th 686
centuri 686
deepli 686
examin 686
inaugur 686
12th 685
@marzi_c_hai 684
hollywood 684
swan 684
@dc_draino 683
@wsj 683
copi 683
gofundme.com 683
kobe 683
wooleri 683
exploit 682
herman 682
insert 682
meat 682
cain 681
dna 681
mount 680
particl 680
relev 680
147 679
inact 679
louisiana 679
seattl 679
#plandem 678
drag 678
percentag 678
vitamin 678
cowork 677
fastest 677
pcr 677
bi 676
hors 676
stronger 676
underground 676
wound 676
diabet 675
missouri 675
@ximenaxmartinez 674
background 674
chip 674
usatoday.com 674
#speakupfordemocraci 673
ayodhya 673
delet 673
hiv 673
50m 672
@profkarolsikora 672
rig 672
sentenc 672
timelin 672
@zev_dr 671
afternoon 671
tragedi 671
yrs 671
#covid19india 670
@maddow 670
jackson 670
method 670
mission 670
talent 670
2m 669
guilti 669
tactic 669
137 668
jobless 668
wapo.st 668
americaw 667
milwauke 667
becaus 666
brag 666
lago 666
submit 666
tirupati 666
83 665
assign 665
experiment 665
ottawa 665
shed 665
@sami_yarbrough 664
finger 664
11000 663
barack 663
bash 663
command 663
portug 663
volum 663
op 662
nc 661
qb 661
youtube.com 661
miracl 660
poster 660
traffic 660
*have 659
occup 659
disagre 658
740 657
into 657
renew 657
theyd 657
44 656
countless 656
par 655
94% 653
outlet 653
gear 652
rebuild 652
romney 652
uncertainti 652
@kurteichenwald 651
whistleblow 651
heavi 650
leftist 650
morrison 650
procedur 650
@cjtruth 649
cvs 649
semest 649
coverup 648
merci 648
roam 648
@sainsburi 647
christma 647
hijack 647
uae 647
@cnnpolit 646
@governortomwolf 646
@rexchapman 646
dri 646
family 646
fortun 646
mccarthi 646
slowli 646
vet 646
@nowthisnew 645
can't 645
insecur 645
qualifi 645
daycar 644
pd 644
profil 644
bungl 642
chapter 642
hike 642
mailin 642
ms 642
problemat 642
refund 642
restor 642
#stayhomestaysaf 641
98 641
invad 641
#trump2020 640
809 640
@brianschatz 640
@govkristinoem 640
cuba 640
hagia 640
incent 640
@cbseindia29 639
exclud 639
@amy_siskind 638
contamin 638
hype 638
latino 638
slight 638
swear 638
thrive 638
spare 637
stayhom 637
sweet 637
tast 637
bracket 636
capita 636
incid 636
marin 636
omga 636
salut 636
bobbi 635
graham 635
nadu 635
nw 635
@askanshul 634
@blooddonorsin 634
@mailonlin 634
daught 634
thus 634
yell 634
86 633
advisori 633
circul 633
imran 633
quarantine* 633
resurg 633
l 632
strips 632
@aubrey_huff 631
mtvhottest 631
n95s 631
approx 630
jon 629
pharmaceut 629
redfield 629
turkey 629
#busi 628
slash 628
superintend 628
anger 627
psycholog 627
ope 626
venu 626
@fred_guttenberg 625
whove 625
#folklor 624
@rawstori 624
buddi 624
weigh 624
anniversari 623
branch 623
radic 623
03 622
bulli 622
rampant 622
@mikel_jollett 621
@vp 621
gay 620
pant 620
switch 620
viewer 620
assam 619
fir 619
disastr 618
distress 618
reduct 618
superstit 618
theme 618
@mrjamesob 617
jose 617
ke 617
oregon 617
tbh 617
cases 616
deangeliscorey 616
@danielandrewsmp 615
@tribunal_watch 615
faculti 615
punch 615
swung 615
vow 615
99% 614
@advocate_alakh 614
guis 614
comprehens 613
gender 613
protestor 613
await 612
refuge 612
tokyo 612
600000 611
airborn 611
ps 611
cap 610
classic 610
cyber 610
10th 609
@drtedro 609
publ 609
roof 609
sophia 609
thrown 609
@breitbartnew 608
homicid 608
her 607
lac 607
quest 607
sept 607
@paulkrugman 606
baltimor 606
fg 606
rand 606
beaten 605
dirti 605
dumbass 605
kroger 605
nbcnews.com 605
resort 605
doh 604
mary 604
newli 604
percent 604
pound 604
seatbelt 604
inch 603
kneel 603
column 602
eric 602
maker 602
pari 602
thee 602
@finallevel 601
grandad 601
lazi 601
pet 601
70% 600
mall 600
tn 600
writer 600
@senatordurbin 599
extraordinari 599
lip 599
river 599
el 598
@mlb 597
belief 597
chronic 597
decept 597
ring 597
soooo 597
stfu 597
twt_gu 597
workforc 597
adequ 596
gag 596
harass 596
theater 596
25th 595
430 595
@thebabylonbe 595
clap 595
grave 595
proceed 595
loud 594
shah 594
startup 594
acosta 593
bat 593
hidden 593
shove 593
behaviour 592
dominic 592
ho 592
mutat 592
pill 592
tini 592
@elonmusk 591
@npr 591
alien 591
almighti 591
lik 591
rona 591
advers 590
bun 590
#lockdownhouseparti 589
@bybrianbyrn 589
asda 589
befor 589
belong 589
champion 589
entrepreneur 589
navig 589
reopening 589
audienc 588
endang 588
meadow 588
strength 588
dakota 587
mo 587
noon 587
1.5k 586
64 586
cow 586
#job 585
@jamestodaromd 585
@mohfw_india 585
fort 585
santi 585
warm 585
baat 584
ex 584
fourth 584
highrisk 584
recruit 584
zimbabw 584
@mollyjongfast 583
jihad 583
smid 583
#maheshbabubdaycdp 582
#ppe 582
@alyssa_milano 582
kaepernick 582
overcom 582
socialist 582
1200 581
jordan 581
surfac 581
vega 581
bake 580
bengaluru 580
bias 579
lifetim 579
tucson 579
anxious 578
daniel 578
entitl 578
hustl 578
invent 578
mornin 578
nbcnew 578
procur 578
4% 577
56 577
@hillaryclinton 577
demolish 577
fought 577
hid 577
robot 577
cape 576
decemb 576
raab 576
12444 575
395 575
grandpar 575
ivanka 575
mec 575
tunnel 575
bbc.in 574
diego 574
facilit 574
knee 574
muzzl 574
only 574
clip 573
uncomfort 573
@atheist_krishna 572
proport 572
stranger 572
#covididiot 571
charact 571
cinema 571
lib 571
ng 571
socialdistanc 571
@jaxalemani 570
@theblaz 570
ha 570
neck 570
net 570
stabl 570
worship 570
14day 569
1b 569
bengal 569
cyrus 569
inevit 569
namo 569
ramaphosa 569
spreader 569
160000 568
burden 568
circumst 568
crise 568
ion 568
technic 568
tout 568
brian 567
olymp 567
root 567
149 566
@joncoopertweet 566
cancelcompartmentexam2020 566
mcenani 566
nursing 566
stroke 566
@amitshah 565
@fullfact 565
chalisa 565
compromis 565
loos 565
massive 565
nova 565
unconstitut 565
behalf 564
ghost 564
mirror 564
53 563
@diamondandsilk 563
affair 563
lifestyl 563
a** 562
eid 562
pollut 562
rescu 562
workout 562
@usatoday 561
@weinsteinlaw 561
@yvettecoopermp 561
quarantine 561
#joebidenjob 560
5% 560
garbag 560
henc 560
humbl 560
stencil 560
zerohedge.com 560
@barstoolbigcat 559
biden2020 559
graph 559
mrna 559
@grantstern 558
@ron_fourni 558
comparison 558
paragraph 558
sober 558
#educ 557
@atrupar 557
tapper 557
71 556
absurd 556
daily 556
priorit 556
prolif 556
#fauci 555
chick 555
concept 555
ghana 555
hilari 555
onto 555
smaller 555
covid19india 554
during 554
kumar 554
nowher 554
psa 554
sweat 554
til 554
ka 553
postpandem 553
@anthonysabatini 552
fruit 552
lindsey 552
grown 551
endors 550
foot 550
onli 550
@killbillevol1 549
casino 549
raw 549
wearamask 549
#1 548
@jrehl 548
bailout 548
loui 548
pl 548
@sbstryker 547
congrat 547
mob 547
summari 547
authoritarian 546
c19 546
obey 546
#blacklivesmatt 545
heavili 545
pilot 545
qanon 545
@dockaurg 544
briton 544
tempt 544
bigil 543
cruel 543
cup 543
famous 543
nz 543
@semispeak 542
epic 542
#actuallyautist 541
decent 541
dismiss 541
onesizefitsal 541
dioxid 540
fame 539
hindu 539
larri 539
reliabl 539
reuter 539
surrend 539
@goplead 538
@norbertelek 538
@saletan 538
another 538
lewi 538
overnight 538
pragya 538
wis 538
brigad 537
licens 537
uganda 537
alex 536
icus 536
mood 536
mountain 536
pod 536
academi 535
cc 535
diagnosi 535
hacker 535
lobbi 535
rick 535
solid 535
tracker 535
visual 535
gandhi 534
scrap 534
riddl 533
tripl 533
wa 533
@b52malmet 532
@zeenew 532
alberta 532
exacerb 532
illustr 532
neighbour 532
#mentalhealth 531
626 531
intervent 531
prolong 531
51 530
@saketgokhal 530
filipino 530
sponsor 530
theblaze.com 530
confin 529
costco 529
francisco 529
oversea 529
silli 529
toot 529
yea 529
2.017k 528
21b 528
@independ 528
jone 528
says 528
postmast 527
preach 527
reimpos 527
unrest 527
alotta 526
habit 526
highthroughput 526
i'm 526
mos 526
disturb 525
fighter 525
ag 524
biden20 524
cos 524
discours 524
ebola 524
integr 524
mi 524
threw 524
choke 523
disneyland 523
wrap 523
1.414k 522
@bbnaija 522
@govmurphi 522
@laurie_garrett 522
meltdown 522
unabash 522
@mebs_it 521
bve 521
constitu 521
elon 521
facial 521
globe 521
grace 521
tension 521
tradit 521
trumper 521
@fordnat 520
auspol 520
eg 520
eh 520
225 519
5000 519
jee 519
finest 518
hoard 518
privaci 518
reign 518
lif 517
mand 517
squirrel 517
underway 517
330000 516
alter 516
convalesc 516
fell 516
municip 516
1100 515
128 515
@ajplus 515
b 515
mosqu 515
oppress 515
ph 515
scotia 515
@cleavon_md 514
coffin 514
extent 514
inc 514
mirror.co.uk 514
regret 514
@jordanschachtel 513
dire 513
flow 513
hajj 513
meghwal 513
neil 513
pastor 513
#onlineclass 512
@ap 512
@oxforddiplomat 512
fam 512
mohd 512
obamacar 512
palestinian 512
please 512
preexist 512
@drharshvardhan 511
enhanc 511
gut 511
mechan 511
utah 511
@mrmichaelburk 510
cake 510
compens 510
ethic 510
farmer 510
larger 510
presum 510
princess 510
doom 509
graphic 509
hank 509
kcet 509
pmqs 509
southwest 509
24th 508
difficulti 508
emergency 508
lebanes 508
schumer 508
#nomask 507
1626395 507
brink 507
nasti 507
pitcher 507
2019 506
hed 506
liabil 506
mask* 506
people 506
67 505
apple.new 505
complac 505
sanitis 505
bankruptci 504
dementia 504
fin 504
kudlow 504
patel 504
#ai 503
guys 503
halt 503
hammer 503
reform 503
74 502
@dnc 502
@maheshfantrend 502
aspect 502
exhaust 502
principl 502
undermin 502
jet 501
monger 501
opp 501
49.31k 500
jai 500
vehicl 500
#heroesact 499
#smartnew 499
