coronavirus 958489
twitter.com 429118
web 383401
mask 254497
pandemic 209408
people 177480
cases 146664
wear 141728
Trump 140880
new 123124
like 119745
000 111908
amp 109198
wearing 108995
masks 104775
virus 103928
positive 95225
dont 92591
schools 88704
#COVID19 87661
get 87352
one 84618
lockdown 82906
deaths 78176
time 76111
Im 72091
Florida 71483
us 69463
19 68214
tested 67957
New 67289
quarantine 65149
think 65039
COVID19 62186
reopen 61859
would 61803
going 60199
cant 59621
face 59293
even 58700
home 58674
months 57088
day 56902
USA 55512
go 53672
public 51543
need 51512
school 51088
news 50671
know 49235
today 48624
10 48296
still 48035
health 47116
Disney 46368
days 46036
back 45383
say 45382
social 45294
make 44649
US 44634
want 43263
see 43238
reopening 41608
first 41425
corona 40227
died 40213
Please 39970
world 39845
World 39726
never 39257
work 38983
many 38159
right 38099
country 37374
The 36548
since 36540
President 36389
last 35747
could 35524
2020 35462
says 35377
every 35371
Dr 35359
distancing 35224
spread 35168
state 35062
take 35004
said 34746
kids 34525
got 33862
death 33850
really 33828
safe 33754
testing 33708
@realDonaldTrump 33562
15 33494
help 33383
everyone 33121
years 32630
York 32346
good 32189
children 32161
rate 31717
11 31686
2.02K 31401
government 31313
students 31221
may 31120
control 30969
Wear 30698
due 30558
lives 30531
test 30084
way 29934
care 29649
BREAKING 29467
Fauci 29435
Corona 29275
#coronavirus 28719
well 28492
Health 28443
to 28433
life 28388
much 28373
wont 28133
also 28061
in 27955
trump 27900
year 27630
July 27539
weeks 27012
open 26980
reported 26916
getting 26856
family 26850
please 26801
07 26513
Americans 26147
ever 25841
CDC 25783
full 25631
risk 25550
hospital 25427
around 25386
isnt 24976
Donald 24697
vaccine 24524
stay 24206
Schools 23939
without 23745
keep 23520
tests 23514
of 23364
went 23300
via 23269
made 22994
patients 22992
week 22900
doesnt 22852
number 22740
and 22665
come 22613
thing 22600
less 22553
12 22391
News 22334
away 22283
Ive 22189
economic 22179
for 21941
youre 21810
didnt 21780
working 21779
die 21738
White 21674
response 21649
must 21338
hes 21312
American 21176
ago 20929
month 20926
nothing 20913
stop 20777
teachers 20609
president 20559
Paul 20542
live 20534
told 20498
30 20434
Trumps 20380
shut 20367
Manafort 20365
better 20302
soon 20300
workers 20242
yesterday 20119
put 20105
two 19998
WEAR 19893
support 19848
already 19763
states 19683
hands 19639
Chinese 19539
long 19536
China 19341
Texas 19316
hours 19306
thought 19241
fight 19163
House 19050
record 18871
money 18748
bad 18727
someone 18438
300 18280
teacher 18254
MASK 18210
United 18194
crisis 18191
real 18149
lice 18069
fact 18011
States 17913
Pandemic 17908
gonna 17861
man 17732
actually 17726
media 17702
others 17701
hard 17478
look 17369
saying 17350
Mask 17321
another 17240
single 17238
PPE 17236
anyone 17226
best 17147
People 17043
things 16872
let 16859
end 16791
the 16771
Everyone 16679
UK 16669
business 16633
wrong 16621
times 16551
unemployment 16542
24 16509
person 16258
plan 16215
trying 16158
done 16097
Virus 16043
numbers 15920
20 15791
seems 15779
love 15767
old 15716
sick 15706
daily 15688
dead 15670
give 15669
14 15555
next 15524
house 15501
One 15490
2 15488
Japan 15433
global 15274
job 15256
understand 15221
data 15069
finally 15006
highest 14993
believe 14964
always 14962
County 14953
India 14930
case 14776
deadly 14718
NEW 14682
yet 14667
past 14624
whole 14550
child 14532
feel 14505
staff 14434
sure 14393
#covid19 14356
exams 14318
March 14286
Masks 14271
needs 14228
great 14224
wants 14160
Dont 14120
reason 14047
part 14033
symptoms 14028
start 14027
thats 14000
taking 13986
tell 13984
watch 13980
making 13972
Care 13917
shouldnt 13908
opening 13902
Thats 13840
Get 13769
is 13766
makes 13714
1000 13625
lot 13613
reports 13559
total 13501
infected 13467
little 13466
mandatory 13424
use 13410
hope 13400
confirmed 13379
economy 13372
95 13325
story 13268
enough 13245
fucking 13221
countries 13197
@ProjectLincoln 13168
friends 13148
Stop 13058
find 13047
called 13028
something 13014
cannot 12922
Face 12902
heart 12897
fall 12896
read 12852
pay 12850
least 12829
science 12824
left 12817
high 12788
save 12769
theyre 12685
used 12649
South 12625
parents 12603
Lets 12589
wow 12555
protect 12549
medical 12511
DeVos 12479
national 12429
Grey 12410
Hospital 12382
Betsy 12379
Meredith 12367
outbreak 12363
130 12337
released 12206
status 12206
@KyleKulinski 12205
State 12201
surge 12142
Biden 12121
party 12119
Due 12117
shit 12117
minutes 12104
wouldnt 12101
study 12063
coming 12035
lost 12025
100 12023
everything 12014
recovered 12003
situation 11959
far 11928
local 11894
looks 11889
lies 11801
either 11789
Medical 11781
Remember 11756
doctor 11746
came 11724
Quarantine 11692
God 11597
free 11565
big 11528
might 11526
dangerous 11508
Lockdown 11469
worst 11467
Gov 11456
middle 11446
took 11443
yall 11441
City 11415
Someone 11383
Government 11321
knew 11243
Thank 11207
recovery 11189
seen 11137
close 11114
3 11105
Read 11058
guidelines 11056
bit.ly 11040
failed 11011
tomorrow 10989
video 10987
fully 10958
mean 10926
per 10921
problem 10911
PM 10894
hospitals 10878
important 10864
point 10836
worse 10808
second 10801
officials 10785
inside 10751
show 10744
damn 10716
Ill 10710
#COVID__19 10689
arent 10685
place 10656
130000 10650
May 10629
giving 10619
visit 10591
experts 10523
run 10505
spreading 10487
lol 10485
listen 10483
change 10472
continue 10457
entire 10456
insane 10447
friend 10410
Walt 10391
dies 10388
Lodge 10382
infection 10365
1 10334
increase 10300
instead 10297
population 10296
theres 10284
Even 10278
hit 10273
else 10260
call 10243
Cases 10238
able 10234
13 10184
white 10113
likely 10109
Wearing 10092
prison 10086
Well 10062
five 10053
solution 9998
whats 9974
wave 9972
funding 9952
leadership 9930
late 9925
Good 9909
become 9902
looking 9887
post 9881
govt 9846
THE 9845
july 9804
im 9802
quick 9801
dying 9798
closed 9790
hand 9787
across 9765
hear 9755
100% 9740
immunity 9735
4 9733
order 9709
Mayor 9678
asked 9648
federal 9624
telling 9619
started 9617
NBC 9592
ones 9585
Hes 9572
5 9551
Doctor 9521
Youre 9520
food 9511
almost 9486
report 9485
especially 9472
share 9414
#COVID 9387
LOL 9342
negative 9329
Home 9315
anything 9307
handling 9287
found 9279
Social 9254
half 9251
doctors 9240
talking 9162
safety 9140
feet 9108
up 9106
34 9102
zero 9090
#covid_19 9055
given 9026
together 9017
nose 8989
hasnt 8987
Michael 8984
First 8969
wonder 8969
outside 8963
happened 8959
Black 8954
members 8953
shows 8938
Yes 8924
political 8920
utm_source 8918
matter 8844
means 8844
team 8810
15300 8793
reminder 8777
Heres 8775
hoax 8773
possible 8761
on 8751
Another 8741
infections 8725
results 8713
utm_medium 8691
Joe 8676
Hi 8665
cause 8662
Hydroxychloroquine 8634
based 8627
Tested 8621
amid 8615
nation 8606
community 8605
fuck 8597
kill 8572
using 8567
hurt 8564
ONE 8559
fear 8558
flu 8547
anymore 8535
guy 8510
india 8509
500 8489
youve 8485
article 8474
with 8463
Today 8445
era 8436
safely 8426
distance 8425
Arizona 8407
stupid 8405
early 8394
ok 8392
lets 8372
Testing 8309
Twitter 8308
gets 8304
no 8290
residents 8287
return 8282
mom 8259
ICU 8248
hate 8245
50 8225
literally 8208
fine 8201
politics 8201
ask 8198
Hong 8172
tweet 8140
Every 8101
NY 8083
running 8076
businesses 8057
ass 8052
normal 8033
guys 8028
ER 8025
vote 8015
follow 7996
latest 7984
55 7981
more 7971
Hey 7947
exposed 7946
Reed 7935
clear 7934
@itsJeffTiedrich 7912
plus 7902
saw 7896
Public 7890
Commissioner 7883
including 7864
Cohen 7838
4th 7836
correctly 7819
seeing 7809
complaining 7801
air 7799
king 7793
Catholic 7787
changes 7787
though 7787
transmission 7782
Nobody 7779
Kong 7764
group 7750
70 7742
learn 7716
exam 7706
reopened 7705
Bill 7698
understanding 7688
idea 7681
California 7646
Kiss 7643
system 7641
send 7640
Look 7621
60 7614
credit 7604
three 7598
police 7591
57 7584
strike 7546
Lives 7545
maybe 7543
Minister 7539
Democrats 7527
National 7516
@CNN 7507
Zealand 7496
decided 7472
@drdavidsamadi 7471
leaders 7467
wait 7462
admitted 7460
young 7431
Dear 7425
disease 7403
travel 7397
Church 7381
tiger 7335
PANDEMIC 7327
sense 7317
spike 7307
twice 7298
history 7290
families 7259
WORLD 7258
rise 7250
rest 7235
Bachchan 7230
Mickey 7227
jobs 7225
happen 7223
Germany 7222
thinking 7212
expert 7211
aid 7194
starting 7180
@BrandonHonaker1 7155
Thanks 7148
taken 7143
scientists 7140
thread 7138
restrictions 7105
GOP 7097
homes 7084
cousin 7074
morning 7069
online 7060
fighting 7058
talk 7055
top 7052
thousands 7043
Governor 7037
@JoeBiden 7032
among 7025
florida 7023
works 7014
student 7010
currently 6978
healthcare 6978
issue 6970
Great 6968
Oh 6964
Death 6956
education 6950
Sydmar 6935
DeSantis 6931
active 6915
mind 6909
Angela 6860
Many 6830
lying 6830
NYC 6822
higher 6800
city 6798
8 6774
rules 6772
campaign 6767
June 6760
try 6757
Guest 6741
Reopen 6738
@JasmineLWatkins 6728
different 6710
small 6690
Deaths 6688
contact 6685
decision 6678
Govt 6674
Breaking 6673
seriously 6656
anxiety 6649
from 6647
Theres 6639
200 6635
hug 6628
simply 6628
decisions 6627
lead 6627
Would 6615
set 6608
reporter 6607
HOURS 6606
knows 6605
55442 6600
Yesterdays 6596
leader 6588
Imagine 6585
human 6584
298 6574
wore 6569
pretty 6559
killed 6558
Also 6552
Update 6549
Reopening 6542
remember 6533
watching 6533
leave 6515
If 6501
Media 6498
absolutely 6498
TEXAS 6488
comes 6486
update 6484
@kylegriffin1 6473
BLM 6466
music 6448
employees 6446
caught 6436
living 6433
low 6432
completely 6423
recorded 6422
To 6421
Walter 6421
forced 6408
rally 6406
EMPLOYEE 6403
recover 6403
wouldve 6398
MINS 6394
happy 6382
dealing 6381
Positive 6373
wears 6361
play 6346
black 6341
kind 6340
private 6331
narrative 6329
gave 6321
true 6321
shake 6317
beginning 6310
result 6303
perspective 6293
nearly 6274
heard 6271
following 6255
weather 6254
biggest 6253
etc 6248
available 6228
policy 6225
herd 6224
Roman 6219
asking 6216
guidance 6203
truth 6203
England 6194
Yang 6194
evidence 6194
Especially 6190
Cristina 6174
acting 6164
@Katlyn_Marie06 6159
behind 6156
advice 6154
43 6148
question 6146
patient 6145
University 6121
prevent 6115
FL 6098
7 6095
alone 6087
scream 6074
Monday 6064
Stay 6053
plans 6053
Secretary 6048
four 6043
@DWUhlfelderLaw 6041
Congress 6033
despite 6029
cancel 6010
summer 6006
April 6002
longer 5972
asymptomatic 5958
impact 5945
forget 5939
Two 5935
office 5934
passed 5931
woman 5926
ways 5925
Sunday 5917
17 5914
@Anthony_HVTCH 5904
COVID__19 5904
fashion 5903
store 5901
Bow 5899
course 5895
continues 5894
speak 5887
citizens 5886
havent 5886
Kneel 5878
21 5869
massive 5868
millions 5868
sir 5868
at 5867
goes 5858
received 5851
18 5850
cut 5836
Education 5834
million 5831
Delhi 5827
frontline 5819
@joshgad 5807
Former 5798
dlvr.it 5788
nationwide 5788
beds 5780
war 5772
Times 5769
heroes 5765
killing 5764
harder 5760
room 5758
probably 5755
refuse 5692
spent 5686
till 5681
Day 5677
serious 5677
capacity 5674
deal 5668
nursing 5658
measures 5649
ppl 5643
CASES 5628
brain 5621
reporting 5619
documents 5616
Like 5605
hitting 5604
hydroxychloroquine 5602
System 5601
mild 5598
08 5597
wasnt 5594
side 5586
Teachers 5584
future 5583
ready 5578
Says 5571
Tulsa 5550
night 5550
hell 5545
singleday 5537
allow 5529
learned 5520
thank 5519
common 5517
takes 5512
caused 5504
healthy 5501
issues 5499
force 5488
Let 5484
selling 5482
wash 5481
putting 5479
agree 5478
effective 5463
treatment 5461
name 5459
planning 5451
Johnson 5446
Total 5428
needed 5421
warned 5405
weekend 5378
goals 5373
Top 5372
current 5368
Bored 5355
November 5355
@thehill 5348
related 5330
soldiers 5326
song 5312
Take 5310
Houston 5308
vs 5298
animators 5295
affected 5289
happening 5286
trust 5277
@Cleavon_MD 5263
25 5258
bring 5229
TV 5226
Merkel 5221
Boris 5220
Id 5214
administration 5214
battle 5208
In 5205
Maybe 5205
Standing 5205
Friday 5204
FYI 5198
Fuck 5197
Keep 5176
worked 5176
Sir 5175
increasing 5173
law 5166
places 5164
protests 5163
allowed 5147
slow 5144
utm_campaign 5144
moment 5136
Never 5132
awful 5121
large 5121
West 5120
lack 5120
32 5116
UGC 5109
Students 5106
fake 5106
Tuesday 5102
allergies 5101
bc 5094
Working 5090
Newsom 5089
@QuecianaWalton 5085
list 5084
sacrifice 5080
sending 5080
join 5076
rising 5076
@KILLBILLEVOL1 5072
Love 5072
wish 5068
reach 5061
Amitabh 5060
Saturday 5060
Man 5051
16 5050
blood 5039
6 5034
failure 5032
shops 5030
research 5025
gone 5022
election 5010
Beijing 5009
NEWS 5006
sad 5003
hot 4998
cure 4997
third 4993
thoughts 4988
body 4986
curve 4981
struggle 4972
jul 4971
buy 4963
women 4963
information 4960
line 4960
folks 4956
thinks 4955
treated 4945
lie 4939
chief 4930
are 4924
bachchan 4922
chance 4921
serving 4915
Doctors 4907
trap 4902
mother 4892
step 4890
Rate 4880
difficult 4875
Pence 4872
1.0K 4851
@ASlavitt 4839
as 4837
toll 4836
Africa 4835
message 4829
bringing 4825
damage 4825
conduct 4821
De 4820
cough 4818
move 4812
refusing 4812
updates 4810
required 4794
Scotland 4793
cover 4792
general 4772
February 4764
example 4758
facing 4753
jail 4753
march 4752
logic 4746
wanted 4745
treat 4735
argument 4728
Canada 4706
respect 4702
choice 4699
contract 4696
40 4695
airborne 4691
age 4684
gloves 4653
easy 4641
talked 4639
level 4638
15000 4637
release 4633
word 4624
catch 4623
power 4616
#1 4610
@SrBachchan 4608
virologist 4607
School 4605
short 4603
Stone 4597
son 4590
Experts 4589
sucked 4571
26 4566
rather 4565
Go 4559
couldnt 4550
N95 4544
#wearamask 4538
Still 4531
thanks 4529
John 4526
huge 4526
San 4523
self 4518
six 4517
county 4510
weve 4501
guard 4499
losing 4499
calling 4497
ventilators 4497
strategy 4495
authorities 4489
mine 4481
politicians 4481
trials 4481
agrees 4480
Mr 4469
endangering 4463
sent 4461
china 4460
relief 4459
REAL 4451
head 4450
theguardian.com 4448
official 4447
schoolsreopening 4445
#lockdown 4443
action 4443
guess 4434
has 4434
lucky 4433
worlds 4423
Back 4421
retweet 4421
Theyre 4419
helped 4419
demand 4402
game 4400
known 4398
Washington 4394
@AkinolaGG 4388
bill 4385
check 4385
#staysafe 4381
mental 4376
tells 4370
@WHO 4369
Europe 4360
announced 4359
Cuomo 4356
according 4355
epicenter 4354
Chief 4352
nobody 4351
Wow 4349
wanna 4348
whether 4348
A 4341
CNN 4327
stand 4324
essential 4319
hearing 4318
afraid 4317
push 4314
season 4314
NEVER 4313
Russia 4311
figure 4305
major 4305
Center 4301
coverup 4299
stuff 4298
09 4291
father 4288
drug 4272
Taiwan 4271
album 4267
@QueeenAve 4260
covers 4254
Sweden 4252
yes 4252
service 4242
poor 4233
speedy 4232
Whats 4229
company 4226
hundreds 4226
prisoners 4225
breathe 4219
tax 4219
unfair 4217
BJP 4213
lied 4208
leading 4206
orders 4205
*us* 4201
reality 4196
Gavin 4195
Tory 4184
threat 4182
obvious 4178
PLEASE 4172
Since 4170
act 4165
loved 4157
Party 4152
later 4150
tired 4145
3rd 4134
90% 4134
unless 4134
Wait 4131
link 4128
lower 4126
lawsuit 4123
press 4119
Nye 4118
temperature 4116
funds 4114
protocols 4111
Republicans 4109
problems 4107
3M 4106
mandate 4105
along 4102
extremely 4100
Republican 4099
words 4098
remote 4096
manager 4095
#trumpvirus 4094
hold 4094
wife 4093
count 4092
Phone 4086
after 4081
beat 4074
provide 4072
GO 4069
experience 4066
dollars 4055
Check 4054
Yet 4053
border 4053
restaurants 4051
broken 4048
challenge 4048
bed 4044
Time 4040
opened 4038
seem 4037
fun 4032
studies 4032
70000 4028
tonight 4026
or 4025
75 4024
straight 4024
@HKrassenstein 4016
novel 4016
CONFIRMED 4015
Anthony 4014
nurses 4007
programmed 4003
companies 3995
governor 3994
refused 3989
137 3987
complete 3982
Make 3975
learning 3975
facts 3972
miss 3967
youtu.be 3966
blame 3958
questions 3947
waiting 3946
checks 3942
Suffering 3940
trib.al 3940
somehow 3934
twitter 3929
pushed 3925
EDUCATION 3921
22 3917
effects 3914
pro 3913
girl 3909
calls 3907
begging 3905
pass 3905
Italy 3903
keeping 3902
45 3900
breaking 3898
baseball 3889
class 3889
supposed 3886
Robert 3880
College 3877
whose 3876
rates 3875
smart 3875
was 3873
According 3862
Ohio 3852
dumb 3852
DEATHS 3843
bars 3842
responsible 3842
vulnerable 3835
BBC 3829
front 3829
okay 3829
Yesterday 3828
@tedlieu 3825
debate 3825
2nd 3822
Thru 3822
dad 3817
@chuckwoolery 3809
cancelled 3809
sports 3807
climate 3806
1.4 3804
interesting 3799
Disneyland 3798
bit 3797
@BaileyCarlin 3796
Gove 3795
productive 3793
attending 3791
turn 3791
idiot 3789
ongoing 3784
Big 3781
TRUMP 3779
classic 3779
avoid 3775
daughter 3774
playing 3774
outrageous 3770
voice 3770
saved 3769
sanitizer 3766
flight 3763
sign 3762
isolation 3758
@rickychavez68 3755
abuse 3750
Weve 3749
birthday 3744
fights 3743
texas 3738
cost 3734
Reporting 3731
claims 3729
August 3726
Ron 3721
Watch 3713
baby 3712
immune 3712
Department 3710
Yeah 3710
forcing 3710
cities 3704
sport 3702
therapist 3701
within 3701
wake 3699
meet 3697
experiencing 3695
carers 3690
paid 3689
peoples 3682
@mitchellvii 3680
sentence 3678
CAN 3677
levels 3672
athletes 3671
efforts 3671
chin 3668
Australia 3666
recent 3665
totally 3665
MASKS 3663
decide 3663
@MSNBC 3661
critical 3660
31 3658
basically 3653
hospitalizations 3651
shutdown 3648
Norway 3646
brother 3645
See 3644
#covid 3637
de 3630
imagine 3624
SARSCoV2 3623
red 3619
Vaccine 3616
ensure 3615
survive 3611
played 3609
governments 3603
Aishwarya 3600
433 3598
Brazil 3595
joke 3594
created 3591
ridiculous 3587
Kids 3582
remain 3582
Lmao 3580
TO 3575
Cant 3573
records 3570
Global 3567
feeling 3567
meeting 3562
Roger 3560
everyday 3560
lose 3559
final 3558
Finally 3556
financial 3554
shame 3554
minute 3551
position 3546
disinformation 3545
nice 3538
Internal 3535
strong 3535
simple 3534
largest 3533
youll 3531
special 3530
protest 3529
rights 3528
helping 3525
scheme 3517
eat 3510
28 3504
Phoenix 3503
former 3501
period 3499
Cummings 3492
Parliament 3489
refuses 3480
explain 3478
exactly 3475
CMP 3473
1st 3470
65 3470
NHS 3468
covering 3462
liberals 3462
North 3459
accuses 3459
@robertspeker 3455
mass 3454
pray 3452
focused 3447
Going 3445
proud 3445
shop 3444
sorry 3442
CM 3439
showing 3438
rule 3437
Pass 3436
@funder 3435
EU 3435
emergency 3435
CHILD 3434
suffering 3430
Daily 3427
EXCLUSIVE 3427
kills 3427
@Ngu_Spesh 3426
brought 3422
recreating 3422
frustrate 3417
Mike 3416
Years 3416
Three 3415
forward 3415
European 3413
except 3413
society 3412
worry 3411
hits 3408
Life 3406
write 3406
STOP 3400
answer 3397
23 3395
delivery 3395
parks 3395
Early 3394
Massive 3393
Denmark 3391
wounded 3391
heat 3390
difference 3387
all 3386
midst 3386
crazy 3385
super 3382
27 3379
@JuddLegum 3379
win 3368
PEOPLE 3362
opinion 3359
everywhere 3358
prayers 3353
@GavinNewsom 3352
security 3349
plague 3348
area 3347
you 3345
pediatric 3344
@bathbodyworks 3343
Got 3340
recently 3338
walk 3334
LA 3331
consider 3330
focus 3328
Force 3327
TX 3325
adults 3325
Flu 3324
Live 3322
governors 3322
customers 3321
London 3319
ow.ly 3318
stopped 3316
standing 3315
theyve 3315
viral 3309
worth 3307
happens 3298
AN 3296
goddamn 3295
began 3289
prepared 3288
changed 3283
potential 3283
walking 3283
not 3282
#pandemic 3281
areas 3272
indoors 3266
lines 3260
ur 3259
arrangement 3258
Store 3251
shifted 3249
access 3248
Data 3246
con 3245
responsibility 3245
For 3243
82 3242
piece 3241
AP 3233
car 3232
review 3232
Democratic 3231
dipshit 3231
fast 3230
amazing 3221
Military 3217
Aries 3215
@itspaola_yoo 3214
cancer 3213
water 3209
gotten 3208
Americas 3207
break 3206
CUSTOMER 3205
loss 3202
out 3202
blamed 3201
Approved 3199
hero 3199
29 3197
Really 3194
project 3193
classroom 3192
have 3191
necessary 3191
Fox 3190
physical 3190
93 3186
concerns 3183
men 3183
amitabh 3182
mouth 3181
Need 3180
Science 3179
expect 3179
book 3174
VIRUS 3169
outbreaks 3167
quarantined 3166
Indian 3162
coverings 3161
depressing 3156
Matter 3155
held 3154
Birx 3152
member 3151
Hello 3150
writing 3146
Worldometers 3143
regarding 3143
And 3139
screaming 3139
#echobox 3138
echobox 3138
sees 3138
personal 3135
immediately 3125
market 3122
unlike 3122
briefed 3118
felt 3118
@MommyFourBoys 3114
Tom 3106
shes 3105
racism 3103
false 3099
WH 3097
actual 3097
bbc.com 3097
indoor 3097
@GovRonDeSantis 3092
definitely 3092
carry 3086
stores 3083
Note 3080
source 3080
informing 3079
worried 3076
Lanez 3074
Prime 3071
hour 3067
@aubrey_huff 3066
beyond 3065
NOT 3064
@DrEricDing 3062
fixed 3061
near 3061
date 3058
CORONA 3056
Adam 3055
scared 3055
asia 3044
restaurant 3042
fauci 3041
clinical 3040
bread 3037
tried 3035
advisor 3029
space 3029
Morgues 3028
Help 3027
attack 3025
industry 3023
reduce 3023
yelled 3021
rich 3017
pressure 3011
be 3009
absolute 3008
flees 3002
services 3001
#BREAKING 3000
aint 3000
@D_1andOnly_ 2999
proof 2999
@marcant96 2997
fans 2997
shot 2996
struggling 2996
paying 2995
preparing 2992
Join 2991
multiple 2989
Centers 2988
STAY 2988
Country 2985
contracted 2983
Blows 2982
Last 2981
administrations 2979
spaces 2979
donate 2978
en 2977
DONT 2976
cnn.com 2976
nurse 2974
resign 2973
shared 2972
RT 2970
rent 2968
Director 2965
military 2959
Karen 2956
kid 2956
More 2954
sex 2954
60000 2949
racist 2945
washing 2945
light 2941
precautions 2939
we 2933
app 2932
protecting 2931
Millions 2929
kept 2929
matters 2927
@jeremiahcota 2926
attacks 2924
concerned 2924
Gates 2922
Bolsonaro 2918
Important 2918
Insider 2917
suppressed 2917
key 2915
contain 2914
effect 2913
Anyone 2912
warn 2909
your 2909
@atensnut 2908
create 2908
@politvidchannel 2906
college 2906
stories 2906
Carolina 2901
Nigeria 2901
ableds 2901
Test 2900
severe 2900
Listen 2899
football 2899
increased 2899
over 2899
spreads 2899
homeless 2898
handle 2895
bus 2892
drills 2892
ji 2888
forever 2887
shooter 2887
2.021K 2886
Floridas 2886
communist 2882
Matt 2881
poll 2876
cautiousness 2875
Bye 2874
gall 2874
2M 2871
Million 2871
suggests 2871
@Reuters 2869
ahead 2868
couple 2867
declaring 2866
ban 2865
Zero 2864
supply 2864
church 2863
interview 2862
request 2860
Ford 2858
uk 2858
attention 2856
pm 2852
players 2847
infectious 2846
Niro 2845
Thread 2843
@narendramodi 2842
STRIKE 2842
2.019K 2841
cuz 2835
gives 2834
correct 2833
@nytimes 2827
growing 2827
@AlexBerenson 2825
campus 2820
international 2819
proper 2819
cold 2814
busy 2813
reached 2813
bake 2810
condition 2810
led 2808
Police 2805
pushing 2805
anywhere 2804
cares 2804
broke 2802
@RexChapman 2801
develop 2801
accosted 2799
vaccines 2797
Free 2794
January 2794
statement 2792
groups 2791
I 2790
spend 2790
claim 2789
flying 2789
expected 2785
several 2782
throughout 2779
disney 2777
causes 2776
nations 2776
antibodies 2775
theme 2775
sit 2772
#stayhome 2768
Vietnam 2761
Obama 2760
@spectatorindex 2759
Yall 2758
parties 2758
@TomFitton 2757
communities 2755
stomach 2752
FUCKING 2750
David 2749
Atlanta 2748
adobo 2748
truly 2748
freedom 2746
choose 2743
Spain 2742
Voted 2741
Russian 2740
taught 2737
Happy 2732
General 2728
Scientists 2727
Despite 2725
driver 2724
On 2721
8000 2719
photo 2719
thru 2719
arizona 2716
corruption 2712
amount 2710
Give 2707
possibly 2706
00 2705
lifts 2705
Melbourne 2703
account 2702
pimienta 2701
Report 2699
Street 2697
followers 2697
quite 2690
@CDCgov 2689
Could 2684
Pero 2682
@ABC 2681
Jersey 2681
@StevenTDennis 2679
selfish 2678
add 2675
conditions 2675
linked 2674
Are 2673
Jordan 2673
amigos 2671
housekeeping 2665
lockdowns 2664
tus 2662
viruses 2662
setting 2660
Dile 2658
god 2657
now 2654
Distancing 2653
apart 2651
staying 2651
fire 2650
humans 2646
require 2646
reut.rs 2645
utm_term 2645
potentially 2642
greater 2640
average 2637
VIDEO 2636
After 2633
role 2633
towards 2632
raise 2631
stress 2630
@jsolomonReports 2628
Brazilian 2627
eyes 2623
paper 2618
POSITIVE 2615
purposely 2615
shown 2614
event 2612
term 2606
risks 2605
twisted 2604
#schoolsreopening 2600
ordered 2600
80 2599
@YouTube 2598
CARES 2596
finds 2593
#trump 2592
Post 2591
Wuhan 2588
Of 2587
@WhiteHouse 2583
address 2582
virusfree 2582
charge 2578
worn 2576
Fake 2573
cast 2573
Fund 2571
warning 2570
299 2568
race 2568
resources 2568
feels 2567
counties 2562
@Thomas1774Paine 2558
5th 2554
mess 2554
clean 2553
blue 2552
realize 2552
developed 2549
Irish 2548
recession 2548
stems 2547
why 2546
deep 2545
@LizHackett 2543
Wales 2543
Hope 2540
Nothing 2540
clearly 2539
chinese 2538
protection 2538
smarter 2536
serve 2531
KNOW 2530
ill 2530
Children 2527
Victoria 2527
mention 2526
HOME 2525
who 2524
info 2521
reasons 2521
classes 2518
building 2517
holding 2517
Thursday 2515
scientific 2515
heres 2514
tracing 2514
promote 2505
todays 2504
MAGA 2500
mortality 2496
facilities 2495
quickly 2495
Must 2494
t.c 2493
voting 2493
attacking 2490
often 2488
track 2488
willing 2486
@juniorbachchan 2483
contained 2482
banned 2481
model 2480
certain 2478
Hospitals 2477
afford 2477
hospitalized 2475
135 2474
idiots 2473
Panel 2472
Work 2472
rid 2469
@w_terrence 2468
Control 2467
fired 2467
previous 2467
Parents 2466
additional 2466
terrible 2466
Angeles 2465
Organization 2465
billion 2465
Want 2463
Refuse 2462
Wash 2462
hill.cm 2460
admit 2459
35 2458
@KrisT_Mak 2458
@GeorgeTakei 2454
disaster 2453
pneumonia 2451
ICE 2450
opportunity 2449
weird 2448
whos 2443
Hanks 2442
perfect 2438
stock 2436
manage 2434
anyway 2432
SEX 2430
turned 2430
@eorden 2427
older 2427
shopping 2424
reading 2423
view 2421
Right 2417
keeps 2417
10000 2415
Los 2414
50% 2410
600 2409
treatments 2408
Ago 2404
IS 2404
Meanwhile 2404
staggering 2401
DC 2400
breath 2399
risking 2398
visitors 2395
sites 2394
Key 2393
laundering 2390
#corona 2389
site 2389
aka 2388
voters 2388
approach 2387
considering 2386
shield 2383
Kui 2378
Tests 2378
criminal 2378
Mexico 2371
MSM 2369
Philippines 2369
Task 2368
heed 2366
warns 2366
ABC 2364
anti 2364
practice 2363
husband 2360
DISEASE 2359
driving 2359
Perhaps 2354
handled 2353
letting 2351
horrifying 2349
Henry 2348
Mississippi 2348
Best 2346
Exactly 2346
wiring 2345
CEO 2343
Federal 2342
drop 2341
0 2340
majority 2340
48 2338
@POTUS 2338
1000000 2336
Democrat 2336
distract 2332
1M 2327
officially 2327
reopens 2327
enjoy 2326
@atrupar 2324
Summer 2321
@AP 2319
African 2319
Caught 2317
disappear 2315
bro 2313
grocery 2313
lady 2311
type 2311
bodies 2310
nye 2309
ya 2309
@GOP 2306
Business 2306
Rai 2305
comment 2305
extra 2305
whatever 2304
stage 2302
surprised 2302
videos 2302
yo 2301
how 2300
plasma 2299
Real 2298
Bringing 2297
threatened 2295
cloth 2294
concern 2294
fraud 2293
ignore 2292
union 2292
moving 2291
Inmates 2290
Tell 2290
tip 2288
Disease 2287
terms 2286
Instead 2285
dr 2285
insanity 2285
will 2284
@PMOIndia 2283
by 2283
compared 2283
ift.tt 2283
Forcing 2281
Maxwell 2277
tender 2276
town 2276
Indias 2274
fresh 2274
south 2274
Youve 2273
@TONYxTWO 2272
bullshit 2271
#florida 2267
Lied 2267
Wednesday 2266
Shes 2265
Patients 2264
basic 2264
Schiff 2263
Response 2261
providing 2260
cool 2259
leaving 2259
pain 2259
Record 2258
effort 2255
Relief 2254
aware 2253
Curbside 2250
@Public_Citizen 2248
beautiful 2248
worldwide 2248
employee 2244
justice 2241
visiting 2240
Team 2237
sound 2236
trans 2236
became 2235
Contributor 2230
contactless 2230
Market 2227
supplies 2227
Worth 2226
antibody 2225
Georgia 2223
danger 2220
involved 2219
Confirmed 2216
Law 2216
during 2216
staged 2216
Raise 2215
hiding 2214
*6* 2212
movie 2212
universities 2212
excuse 2211
limits 2210
AZ 2209
#speakupforstudents 2208
tweets 2208
# 2207
digital 2205
picture 2204
OF 2203
steps 2201
Detroit 2198
werent 2198
Sechenov 2197
releasing 2197
discuss 2196
earlier 2196
343 2195
sleep 2195
withhold 2190
@TheRickWilson 2187
Abhishek 2185
sharing 2185
Israel 2184
samples 2182
treating 2182
High 2181
non 2181
commercial 2180
reduced 2179
@RealJamesWoods 2177
@RepSwalwell 2177
Chancellor 2177
passengers 2177
99% 2175
Sign 2174
fatality 2172
Rally 2170
Lol 2166
notice 2165
games 2163
funny 2161
Praying 2158
encourage 2158
ON 2157
repeat 2155
Jair 2152
40% 2151
incompetence 2145
costs 2143
Numbers 2142
it 2142
panic 2142
properly 2142
900 2140
Amid 2139
Food 2139
#socialdistancing 2138
@BorisJohnson 2137
LIVE 2135
Things 2134
phone 2134
fund 2133
deserve 2129
suggest 2129
details 2127
Karnataka 2126
laugh 2126
NJ 2125
socially 2125
Keeping 2124
olds 2124
threatening 2120
@NYGovCuomo 2116
aishwarya 2115
@RichardGrenell 2114
TESTING 2114
owned 2114
growth 2113
glad 2111
successfully 2111
catching 2109
double 2108
mad 2108
showed 2108
Union 2106
137000 2105
Gym 2105
STILL 2105
saving 2104
Vote 2103
Korea 2101
epidemic 2100
horrible 2099
*the 2097
raging 2097
district 2096
letter 2096
Trucks 2095
Pelosi 2094
attend 2093
estrogen 2093
gt 2093
refusal 2092
Idk 2091
signs 2091
university 2091
Release 2090
conspiracy 2090
helps 2089
elderly 2088
claiming 2087
flatten 2085
@RahulGandhi 2083
Abbott 2083
Bollywood 2082
Michigan 2081
Remdesivir 2081
rai 2081
arrested 2080
Autofeed 2079
200000 2077
taking* 2077
Johns 2074
Risk 2074
supporting 2074
sitting 2073
training 2072
Hancock 2071
Trudeau 2071
recoveries 2071
boy 2070
#covid19uk 2067
oxygen 2067
posted 2067
worker 2067
188 2065
Ireland 2065
added 2063
gathering 2063
@EricEarly_CA 2062
offer 2062
demanding 2061
pick 2057
AND 2056
comments 2056
compulsory 2056
published 2053
NO 2052
@MollyJongFast 2051
Blocks 2051
tough 2051
Paris 2049
St 2048
democrats 2048
complications 2045
illness 2044
income 2044
center 2039
progress 2039
strict 2039
2.018K 2038
dude 2038
fool 2037
prove 2036
Follow 2035
completed 2035
articles 2034
classrooms 2034
insurance 2034
Lord 2033
K12 2032
admitting 2032
victims 2030
Sorry 2028
WOW 2023
9 2022
Amit 2022
Refrigerator 2022
FACE 2020
supporters 2020
executive 2019
inmates 2019
CONTROL 2015
equal 2015
useless 2015
@Craig_A_Spencer 2014
@DrDenaGrayson 2012
yeah 2010
Little 2009
park 2008
1.2K 2006
minister 2006
Updates 2003
confused 2002
laid 2002
@BetsyDeVosED 2001
ABSCBN 2001
Workers 2001
Aaradhya 2000
note 2000
requiring 1999
@Wolfe321 1998
points 1998
Administration 1997
listening 1996
breathing 1995
married 1995
MUST 1994
Think 1993
price 1991
illegal 1989
remdesivir 1989
@NBCNews 1988
fears 1988
fellow 1988
JANUARY 1986
Admits 1985
eating 1981
Earlier 1980
Find 1978
Review 1972
mayor 1972
badly 1971
speaking 1970
Family 1969
Almost 1968
bitch 1968
energy 1968
Mumbai 1967
fam 1965
YOU 1964
conference 1964
historian 1964
anyways 1963
botched 1963
contributed 1962
coworker 1962
@Acosta 1961
generated 1961
#amitabhbachchan 1960
badass 1958
youd 1958
Chuck 1957
events 1956
nightmare 1954
Sounds 1952
stopping 1952
can 1951
followed 1951
lots 1951
Learn 1950
culture 1949
magic 1948
Left 1946
CA 1945
inform 1945
streets 1945
pls 1943
incredibly 1942
George 1941
Second 1941
claimed 1940
Network 1939
combined 1939
tally 1938
148 1937
Putin 1937
criminals 1936
drive 1935
discredit 1934
trip 1933
teaching 1932
AGENCY 1929
hide 1929
Britain 1928
Governors 1928
British 1925
ruining 1925
suit 1924
Overflow 1922
hair 1921
Mars 1918
understood 1918
FUCK 1917
Kanye 1916
wrote 1914
missed 1913
Virologist 1912
@ItsChristinaW 1911
Modi 1911
Rail 1911
process 1911
ad 1909
benefits 1909
buff.ly 1908
puts 1908
include 1907
spending 1907
Is 1906
Seriously 1906
WATCH 1905
met 1904
Todays 1903
professionals 1902
therell 1901
Blood 1898
announce 1898
@washingtonpost 1897
ICYMI 1897
War 1895
charging 1895
diagnosed 1895
Mandatory 1894
Okay 1894
theory 1894
parliament 1893
@SethAbramson 1892
fucked 1890
virtual 1889
overnight 1887
angry 1886
99 1884
alcohol 1884
DAY 1883
Surgeon 1883
defeated 1883
gon 1882
peak 1882
sucks 1882
@CBSNews 1881
phase 1880
corrupt 1879
Next 1878
01 1877
closing 1877
hotel 1874
crowded 1873
appears 1872
quarantining 1872
@ewarren 1868
announces 1868
arrest 1868
breaks 1868
challenges 1868
Nancy 1865
lock 1865
stimulus 1865
reveals 1864
#mask 1862
looked 1861
website 1861
Brexit 1860
Earth 1859
Study 1859
UPDATE 1859
crime 1859
06 1857
GET 1857
Recovery 1856
agenda 1856
highly 1856
HCQ 1855
goal 1855
#indiafightscorona 1854
limited 1854
camp 1851
none 1849
Was 1848
titled 1848
As 1847
counting 1846
ended 1845
mainstream 1845
Impact 1844
task 1844
wondering 1844
Hot 1840
smh 1840
bar 1839
lakh 1839
Video 1838
remove 1838
drugs 1836
policies 1836
France 1835
honestly 1835
10th 1834
@DrRPNishank 1834
LOCKDOWN 1834
neighborhoods 1834
How 1833
knowing 1833
Claims 1832
fever 1831
@Lrihendry 1830
Determine 1830
Went 1830
boycott 1830
tweeting 1829
WHOLE 1828
diseases 1828
success 1828
Wants 1825
locked 1825
alive 1823
meant 1822
vibe 1822
Court 1821
prevented 1821
Full 1818
beach 1817
host 1817
conducting 1815
director 1814
round 1814
scenario 1814
golf 1813
land 1813
proven 1813
HELP 1812
visits 1812
@CNNPolitics 1811
11433 1810
Actor 1809
similar 1808
expensive 1807
Airborne 1806
400 1804
incompetent 1804
bigger 1803
@ugc_india 1801
program 1801
Digital 1800
Premier 1800
134 1799
RIGHT 1799
missing 1797
t. 1795
sets 1794
toilet 1794
considered 1793
@mmpadellan 1792
Interviews 1792
unable 1792
ends 1791
Online 1790
teach 1790
attended 1789
Took 1788
faces 1787
environment 1786
#arizona 1783
#COVID-19 1782
bleach 1782
enforce 1782
America 1781
lungs 1781
Air 1780
Goliath 1780
stands 1779
systems 1779
taxes 1779
conducted 1778
droplets 1778
priority 1778
figures 1777
Story 1775
survival 1775
everybody 1773
Press 1772
becoming 1772
lab 1772
Pushing 1771
build 1770
contagious 1770
warriors 1770
Exams 1769
oh 1769
wonderful 1769
Centre 1768
americans 1768
development 1768
Central 1767
Japans 1767
Dept 1766
Kingdom 1766
Richard 1766
Pres 1765
remains 1765
fics 1764
dramatic 1762
mostly 1762
wattpad 1762
Cornyn 1760
emerging 1760
Maharashtra 1758
Who 1758
@joncoopertweets 1757
BMC 1757
nature 1757
crossed 1756
gotta 1756
enemy 1755
perfectly 1755
@akamatsucore 1754
management 1754
theyll 1754
consequences 1753
greatest 1753
Steve 1752
issued 1752
East 1751
headlines 1751
tips 1751
unprecedented 1750
stuck 1749
Say 1748
longterm 1748
roller 1747
allowing 1746
romanticised 1746
evil 1745
suffer 1745
@ANI 1744
mark 1744
fair 1743
medicine 1742
riots 1741
Senator 1740
unemploymentyet 1740
shatters 1738
Ok 1737
fit 1737
800 1736
Costco 1736
upon 1735
exact 1734
Navajo 1733
Spread 1733
directly 1733
successful 1733
Ontario 1732
Sen 1732
surpassed 1732
display 1731
gov 1731
COVER 1730
Yep 1728
predicted 1728
presidents 1728
road 1726
ignored 1725
@jaicabajar 1723
stats 1723
tyranny 1723
begin 1718
Protect 1717
3000 1716
secret 1716
shortage 1716
touch 1716
Emergency 1714
@GovMurphy 1713
homeschooling 1713
blog 1712
continued 1712
infect 1710
@RonDeSantisFL 1709
door 1708
pubs 1707
Santa 1704
120 1702
Roof 1702
Quarantined 1701
King 1700
NYS 1699
transport 1699
10% 1698
Faucis 1698
this 1698
admits 1697
fix 1697
virologists 1697
spoke 1696
bounty 1695
OMG 1694
Staff 1692
earth 1692
forgot 1692
trumps 1690
Absolutely 1689
Bible 1689
apparently 1689
quarentena 1688
girls 1687
migrant 1686
network 1683
POTUS 1682
drink 1681
postpone 1680
series 1679
HUGE 1678
SA 1678
ignorant 1678
upset 1678
club 1677
36 1676
Federation 1675
FAKE 1674
leaves 1673
DEADLY 1672
significant 1672
People’s 1670
Fall 1669
Previous 1669
pics 1669
sheep 1669
Died 1668
survey 1668
threatens 1668
@ebonybowden 1667
about 1667
centre 1667
poverty 1666
presidential 1666
adding 1665
gatherings 1665
shares 1665
Amazon 1664
amidst 1664
easily 1664
fed 1664
starts 1664
actions 1663
BS 1662
sister 1662
unemployed 1662
Put 1661
Herm 1659
passing 1658
views 1658
Chris 1657
churches 1657
voted 1657
intentionally 1656
medium.com 1656
YouTube 1655
Antonio 1653
IN 1653
california 1653
90 1652
However 1652
begins 1652
murder 1652
disgraceful 1651
housing 1651
peacefully 1650
spot 1650
obviously 1648
bet 1647
NSW 1645
Looking 1644
Theyve 1644
staysafe 1644
corporate 1642
Families 1639
returning 1639
trillion 1639
coverage 1637
preview 1637
trend 1637
Immunity 1635
Crisis 1633
degree 1633
700 1632
donald 1631
moved 1628
67% 1627
@hossehenad 1627
65000 1626
technology 1625
hong 1624
Billion 1623
usually 1622
PCR 1621
September 1620
internet 1620
violence 1620
SATs 1619
doubt 1619
through 1619
ventilator 1619
Getting 1617
kong 1616
Show 1615
ally 1615
welcome 1614
certainly 1612
flights 1612
Thailand 1611
mistake 1611
option 1611
From 1610
blaming 1609
WEARING 1608
younger 1608
DM 1607
Herd 1606
confirms 1606
briefing 1605
scene 1604
Without 1603
provided 1602
that 1601
requires 1599
1.918K 1598
FREE 1597
becomes 1597
#COVIDIOTS 1594
38 1594
form 1594
maintain 1594
scary 1594
Apparently 1593
CT 1593
spikes 1593
Come 1590
Martinez 1590
pieces 1589
@B52Malmet 1588
shields 1588
Revealed 1587
Huni 1586
winning 1586
NEED 1585
Ninawa 1585
#SARSCoV2 1584
protective 1584
trial 1584
Human 1583
WITHOUT 1583
uptick 1583
Support 1581
vernunftundrichtigkeit 1581
Soooo 1580
surprise 1580
transmit 1579
mail 1578
excited 1576
Increased 1575
apply 1575
board 1575
convention 1575
250 1574
@Suriya_offl 1574
Keisha 1574
bounties 1574
main 1574
raising 1574
analysis 1573
propaganda 1573
wed 1571
Plan 1570
stupidity 1570
teams 1569
Corpus 1567
limb 1567
fees 1566
@DrJenGunter 1565
Critical 1565
Active 1564
Cure 1564
Reveals 1564
Mark 1563
books 1563
spiking 1563
JULY 1562
hoping 1561
mandates 1561
respiratory 1559
whenever 1558
Order 1554
priorities 1554
Dan 1552
accurate 1552
#aishwaryaraibachchan 1551
MONTHS 1551
shouldve 1551
Weeks 1550
plant 1550
sales 1550
present 1549
Miami 1547
mil 1545
Soon 1543
cash 1543
honest 1543
prepare 1543
Greg 1542
1.5 1539
webinar 1539
30yearold 1537
Someones 1537
against 1537
personally 1537
surging 1537
Virginia 1536
cleaning 1536
@JohnCornyn 1535
ignoring 1535
@maddow 1534
brave 1534
grow 1534
@SkyNews 1533
Andrew 1532
managed 1531
feed 1530
Facebook 1529
THIS 1529
sector 1529
Shutting 1527
duty 1527
outdoor 1527
star 1526
Fans 1525
patriot 1525
@darakass 1524
Sexual 1523
causing 1523
symptom 1523
Security 1522
Jesus 1521
flow 1521
appreciate 1520
doors 1520
usual 1520
44 1519
accept 1519
celebrate 1518
disgrace 1516
favorite 1516
nytimes.com 1516
Safe 1515
VACCINES 1515
rn 1515
MEANS 1514
equipment 1514
value 1514
Isnt 1513
@catturd2 1508
ran 1508
seconds 1508
#texas 1507
disappears 1507
@business 1506
Kim 1506
careful 1506
regular 1506
trash 1506
442 1505
@katlia124 1505
Canadian 1505
Random 1505
awareness 1505
Damn 1504
impossible 1504
2000 1503
Violators 1503
YOUR 1503
exposure 1503
implement 1503
@BurgerKing 1502
37 1501
movement 1500
15299 1499
International 1499
Christmas 1498
surges 1497
#COVID19inSA 1496
None 1496
RIGHTS 1496
conversation 1496
grown 1496
na 1496
court 1494
CCP 1493
whatll 1493
Reports 1492
posts 1492
30s 1491
Lady 1491
Open 1491
fest 1491
Tracking 1490
page 1490
interest 1488
gyms 1487
toddler 1487
@TedCruz 1485
ANC 1485
mood 1485
Via 1484
base 1484
email 1484
revealed 1484
jump 1483
remind 1483
canada 1482
GLOBAL 1480
utm_content 1480
Hedge 1479
HAIKYUU 1478
Ministry 1478
coasters 1478
prisons 1478
Captured 1477
motivation 1477
wanting 1477
humanity 1475
individuals 1475
postponed 1475
debt 1474
gun 1473
1045am 1472
1% 1471
emotions 1470
terrific 1470
alert 1469
drinking 1469
signed 1468
LIKE 1466
Park 1466
panel 1466
#china 1465
@dbongino 1465
reverse 1465
ICUs 1463
WHO 1463
childrens 1462
Christi 1461
ive 1460
Plasma 1457
Use 1457
unknown 1457
@Fightfor15LA 1456
Die 1456
bank 1456
Gmez 1455
Retweet 1455
Current 1454
Floyd 1454
NOTHING 1454
extreme 1454
@NPR 1451
Pakistan 1451
Gauteng 1450
Surge 1450
ability 1450
Case 1449
Welcome 1449
believes 1448
falling 1448
prevention 1448
continuing 1447
Unfortunately 1446
ground 1446
Rising 1445
approval 1445
reaction 1445
AM 1444
Economic 1443
Walmart 1443
impacted 1443
street 1443
wall 1443
Missouri 1442
Nearly 1442
facemasks 1442
unions 1441
551 1440
cheer 1440
natural 1440
rawstory.com 1439
wellbeing 1439
Young 1438
destroy 1438
soap 1438
trending 1438
Year 1437
delay 1436
@AnupamPKher 1435
Hell 1435
32343 1434
contracting 1434
genuine 1434
GIRL 1433
Truth 1433
buying 1433
art 1430
products 1430
71 1429
Call 1429
respond 1429
Nation 1428
content 1428
trump2020 1427
@SheepKnowMore 1426
defeat 1425
facility 1425
suriya 1425
Closed 1424
crying 1424
rioters 1424
Phase 1421
Job 1420
33% 1419
positivity 1419
customer 1418
explains 1418
receiving 1417
borders 1416
waste 1414
Greater 1413
sell 1413
turning 1413
Officer 1412
inperson 1412
Finnegan 1411
Louisiana 1411
bought 1411
finding 1411
packed 1411
This 1410
colleagues 1410
pandemics 1410
pre 1410
april 1409
Gilead 1408
contracts 1408
when 1408
interested 1407
affects 1406
exist 1406
friday 1406
taxpayerbacked 1405
throw 1405
No 1404
fail 1404
Act 1403
Latest 1403
fault 1402
holds 1402
vent 1402
Looks 1401
bunch 1401
#stayathome 1400
11000 1400
crowd 1397
liberal 1396
My 1395
@VP 1394
@jaketapper 1394
eye 1394
thehill 1394
extended 1393
pub 1393
denied 1391
50000 1390
@GovWhitmer 1390
donation 1390
shocked 1390
5% 1389
He 1389
affect 1389
ndtv.com 1389
Leicester 1387
Made 1387
y 1387
lesson 1386
storm 1386
hey 1385
moron 1385
@gatewaypundit 1383
boss 1382
competent 1382
scam 1381
@Mariah__Driver 1378
#suriyabirthdayfestcdp 1377
@DC_Draino 1377
Apprentices 1377
True 1377
dog 1377
receive 1377
COMPLY 1376
discharged 1376
production 1376
tech 1376
graves 1375
lung 1375
neurological 1375
protesting 1375
#COVID_19 1374
benefit 1373
enter 1373
Amazing 1371
dark 1371
@JRubinBlogger 1370
MHRD 1370
Pay 1370
cbsn.ws 1370
id 1370
15th 1369
shift 1369
Save 1367
Tacking 1367
nonsense 1367
publicly 1366
assume 1365
deliver 1365
traitor 1365
OPEN 1364
labs 1364
@cnni 1362
maskwearing 1362
Wishing 1361
Goya 1360
TIME 1359
Texans 1359
taxpayer 1359
empty 1358
film 1358
impacts 1358
finances 1357
than 1357
MiamiDade 1356
TAKE 1355
districts 1355
wild 1354
OK 1353
@bryanbehar 1352
Camp 1352
changing 1352
biden 1351
blessing 1351
089% 1350
135000 1350
@propublica 1350
asks 1350
usd 1350
larger 1349
Spanish 1348
pull 1348
Communist 1347
field 1345
shock 1345
talks 1344
Seo 1343
Patient 1340
Alabama 1339
activities 1339
basis 1339
@DeAnna4Congress 1338
painted 1338
stayhome 1338
14000 1337
@benshapiro 1337
dear 1336
English 1335
Andrews 1334
Hopkins 1332
Dulari 1331
discussion 1331
hrs 1330
Terror 1328
brl 1328
hadnt 1328
#CULTforGOOD 1326
Days 1326
GDP 1326
Economy 1325
caring 1325
planet 1324
wasted 1324
rock 1323
Better 1321
associated 1321
cry 1321
neither 1320
threats 1320
Countries 1319
coronaviruss 1319
underlying 1318
weak 1318
Interesting 1317
depression 1317
examination 1317
answers 1316
hotspot 1316
pregnant 1316
Major 1315
BIG 1314
appear 1314
parent 1314
@TexasTribune 1313
RETWEET 1313
looting 1313
volunteers 1313
Guy 1312
Khan 1312
direct 1312
hygiene 1312
parts 1312
delhi 1311
describe 1311
legal 1311
Dems 1310
Months 1310
Project 1310
senior 1310
Senate 1309
Share 1309
About 1308
but 1308
elected 1308
encouraging 1308
Illinois 1307
tourists 1306
@ChuckCallesto 1303
REMINDER 1302
centers 1302
controlling 1302
expose 1302
videoclip 1301
Research 1300
Warning 1300
creatures 1300
investigation 1300
entry 1299
fourth 1299
urge 1299
Everything 1298
We 1298
curfew 1298
harm 1298
VACCINE 1297
Taking 1296
SOCIAL 1295
@vivek_murthy 1294
Chinas 1294
challenging 1294
owner 1294
region 1294
importance 1293
actor 1292
dealt 1292
Contact 1291
disgusting 1291
Canadians 1290
Morrison 1290
THREAD 1289
Guys 1288
seeks 1288
holiday 1287
compare 1286
session 1285
updated 1285
Hopefully 1284
Prevention 1284
decimated 1284
flattening 1284
mentioned 1283
67 1282
Community 1282
ocid 1282
authority 1281
battling 1281
30% 1280
benpershing 1280
inflated 1280
its 1278
Council 1277
Lagos 1277
Scott 1277
confirm 1277
tho 1277
unnecessary 1277
PPP 1276
Red 1276
rises 1276
Recovered 1275
Scamdemic 1275
CULTforGOOD 1274
trade 1274
profit 1273
realdonaldtrump 1273
District 1272
Yorks 1272
cuts 1272
speech 1272
Company 1271
spots 1271
tulsa 1271
BACK 1270
luxury 1270
@QuickTake 1269
78 1268
sunday 1268
MP 1267
Tale 1267
aged 1267
Morning 1266
Scottish 1266
#masks 1265
@ryanstruyk 1265
Moscow 1264
groceries 1264
prices 1264
Folks 1263
pee 1263
@AnaCabrera 1262
@NicolaSturgeon 1262
bonus 1262
credibility 1262
individual 1262
Freedom 1261
approved 1261
Women 1260
ABS-CBN 1258
Unless 1258
cdc 1258
globally 1258
somebody 1258
troops 1258
Asked 1257
Service 1257
drones 1257
hi 1257
@rejectedjokes 1256
Justice 1256
Safety 1255
weigh 1255
WTF 1254
countrys 1254
entering 1254
links 1254
GIVE 1253
rapidly 1253
responses 1253
While 1252
gym 1252
Seems 1251
episode 1251
negligence 1251
spare 1251
20% 1250
Office 1250
Isolation 1249
tothis 1248
Dharavi 1247
popular 1247
cult 1246
failing 1246
pressured 1246
approve 1245
mobile 1245
Part 1244
wine 1244
scientist 1242
worrying 1242
crap 1241
concerning 1240
outdoors 1240
spewing 1240
@seanhannity 1239
Guess 1239
insisting 1239
Hand 1238
june 1237
Plus 1236
adequate 1236
green 1236
remotely 1236
MAY 1235
trouble 1235
written 1234
#quarantine 1233
390 1233
fatalities 1233
grade 1233
budget 1232
overthis 1231
Dies 1230
Doesnt 1230
Floridians 1230
package 1230
shamefulif 1230
Ducey 1229
hid 1229
launched 1229
urgently 1229
33 1228
7yo 1228
Pls 1228
evening 1228
ride 1228
hunger 1227
primary 1226
ignorance 1225
NZ 1223
creative 1223
gunned 1223
overwhelmed 1222
stayathome 1222
load 1221
fan 1219
426 1218
@RealMattCouch 1218
fined 1218
flew 1218
@IngrahamAngle 1217
SCHOOL 1217
foreign 1217
100000 1216
French 1216
doc 1216
dropped 1216
Currently 1215
creating 1215
wide 1215
#maskup 1212
#noexammhrd 1212
largely 1212
scandal 1211
universe 1211
performance 1210
should 1210
sounds 1210
rat 1209
devastating 1208
Bradenton 1207
CANCEL 1207
Ipsos 1207
finished 1207
COVIDIOTS 1206
FOR 1206
Source 1206
entertainment 1206
firm 1206
wishes 1206
HOAX 1205
offering 1205
wapo.st 1205
buddy 1203
luck 1203
protesters 1203
@guardian 1202
returned 1202
Jim 1201
declared 1201
glasses 1201
irresponsible 1201
trace 1201
05 1200
combat 1200
IMPORTANT 1199
Nicola 1199
spectacular 1199
Kokilaben 1198
coronaviruses 1198
powerful 1198
chances 1197
statistics 1197
@JaniceDean 1196
FINALLY 1196
kits 1196
rank 1196
abhishek 1195
lowest 1195
Hampshire 1193
Late 1192
recommend 1192
Four 1191
Japanese 1191
Leader 1191
dream 1191
Christian 1190
With 1190
physically 1190
yrs 1190
delayed 1189
department 1188
particularly 1187
uteruses 1187
2.016K 1186
embarrassment 1186
80% 1185
pop 1185
Governments 1184
History 1184
Mass 1183
misery 1183
includes 1182
emotional 1181
watched 1181
3x 1180
achieve 1180
#news 1179
Dallas 1179
educator 1179
56 1178
@keithboykin 1178
Mildly 1178
recommendations 1178
Ever 1177
SCHOOLS 1177
UBI 1177
@layzhang 1176
airport 1176
@KeishaBottoms 1175
Biggest 1175
League 1175
planned 1175
what 1175
Local 1174
Han 1173
FACTS 1172
Against 1171
coronavirus19 1171
easier 1169
kinda 1169
Cautionary 1168
Easiest 1168
UN 1167
Infected 1166
VP 1165
@Breaking911 1164
Clinical 1164
assistance 1164
doggin 1164
gain 1164
mandated 1164
suicide 1164
Final 1163
heads 1163
quality 1163
25% 1162
Six 1162
backpack 1162
exempt 1162
MASS 1161
GOOD 1160
Unions 1160
instagram.com 1160
vacation 1160
Nursing 1159
bbc.in 1159
takeout 1159
therapy 1159
upcoming 1159
239 1158
663 1158
brexit 1158
innocent 1158
op 1158
FDA 1157
Petition 1157
Shame 1157
citing 1157
hai 1157
latimes.com 1157
reelection 1156
WALKING 1155
WANT 1155
africa 1155
closer 1155
#india 1154
dedicated 1154
hospitalization 1154
misinformation 1154
offered 1154
483 1153
Doug 1153
excellent 1153
150 1152
bulletproof 1152
Bernie 1151
Labor 1151
denial 1151
weight 1150
73 1149
Always 1149
cnn.it 1149
lessons 1149
method 1149
failures 1148
yr 1148
Rather 1147
#USA 1146
tour 1146
@steveaoki 1145
Orange 1145
a.msn.com 1145
Asia 1144
Long 1144
Virtual 1144
aaradhya 1144
charter 1144
chose 1144
detail 1144
owners 1144
purpose 1144
random 1144
dollar 1143
aside 1142
@murdabeatz_ 1141
Bannon 1141
FBI 1141
Holy 1141
covered 1141
motherfuckers 1141
spittle 1141
Dominic 1140
Serious 1140
persons 1140
Tonight 1139
bubble 1139
odd 1139
tracers 1139
@ashoswai 1138
App 1138
Pradesh 1138
lmao 1138
@ThePubliusUSA 1137
Fredo 1137
Gujarat 1137
built 1137
solutions 1137
Anupam 1136
elections 1136
inquiry 1136
Hazmat 1135
REALLY 1135
stays 1135
ward 1135
Loans 1134
SC 1133
anybody 1133
@HRDMinistry 1131
Flees 1131
Vice 1131
unimaginable 1131
Sturgeon 1130
coronavirusrelated 1130
informed 1130
screams 1130
topic 1130
plandemic 1129
politically 1129
statewide 1129
suddenly 1129
ENTERING 1128
populated 1128
tucked 1128
@WalshFreedom 1127
Send 1127
tears 1127
Can 1126
richer 1126
1426483 1125
Australian 1125
Bulletproof 1125
researchers 1125
Worldwide 1124
@gavinesler 1123
Mitch 1123
Money 1123
NBA 1123
Western 1123
333 1122
@ndtv 1122
Latex 1121
donated 1121
silent 1121
trnd 1121
regulations 1120
Healthcare 1119
arrived 1119
universal 1119
@SidneyPowell1 1118
Kenya 1118
domestic 1118
firsthand 1118
Five 1117
Situation 1117
deadlier 1117
flag 1117
lunchbox 1117
violent 1117
@tacomaliberal81 1116
Bank 1116
Nurse 1116
Something 1116
increases 1116
trapped 1116
vital 1116
am 1115
forgotten 1115
incredible 1115
island 1115
jobless 1115
Close 1114
positives 1114
@BlueSteelDC 1112
Cancel 1112
civil 1112
Committee 1111
147 1110
Hall 1110
Needed 1109
Telangana 1109
Way 1109
headline 1109
otherwise 1109
reportedly 1109
stops 1109
42 1108
@ArvindKejriwal 1108
Koreas 1108
Orlando 1108
Nice 1107
cross 1107
houses 1107
protected 1107
sort 1107
Told 1106
Club 1105
faster 1105
shattered 1105
Cyril 1104
foxnews.com 1104
raised 1103
sources 1103
sue 1103
Serbia 1102
raided 1102
silver 1102
infecting 1101
lawmakers 1101
survivor 1100
Gandhi 1099
believed 1099
factor 1099
sometimes 1099
zone 1099
21st 1098
GOING 1098
accelerating 1098
offices 1098
charged 1097
tourism 1097
@nowthisnews 1096
train 1096
unnecessarily 1096
Old 1095
TODAY 1095
liar 1095
capitalism 1094
identify 1094
LOVE 1093
boris 1093
LOWER 1092
Peoples 1092
Sure 1092
Mary 1091
hysteria 1091
other 1091
@JesseRodriguez 1090
Unemployment 1090
X1 1090
perhaps 1090
QUARANTINE 1089
Refusing 1089
youth 1089
@only4csy 1088
Funding 1088
managing 1088
Thousands 1087
block 1087
leads 1087
votes 1086
Don’t 1085
Friends 1085
pathetic 1085
throwing 1085
@MoHFW_INDIA 1084
Bodies 1084
Shut 1084
61 1083
72 1083
Leave 1083
Likely 1083
